import React, { useRef } from "react";
import logo from "./assets/logo.png";
import burger from "./assets/icons/burger.png";
import logoWhite from "./assets/logoWhite.png";
import testImg1 from "./assets/imgs/testImg1.jpg";
import testImg2 from "./assets/imgs/testImg2.jpg";
import testImg3 from "./assets/imgs/testImg3.jpg";
import testImg4 from "./assets/imgs/testImg4.jpg";
import testImg5 from "./assets/imgs/testImg5.PNG";
import testImg6 from "./assets/imgs/testImg6.PNG";
import testImg7 from "./assets/imgs/testImg7.PNG";
import testImg8 from "./assets/imgs/testImg8.PNG";
import testImg9 from "./assets/imgs/testImg9.PNG";
import testImg10 from "./assets/imgs/testImg10.PNG";
import testImg11 from "./assets/imgs/testImg11.PNG";
import "./components/Test.css";
import papersIcon from "../src/assets/icons/papersIcon.png";
import close from "./assets/icons/close.png";
import { useState } from "react";
import "./App.css";
import arrow from "./assets/icons/arrow.svg";
import Offcanvas from "react-bootstrap/Offcanvas";
import emailjs from "@emailjs/browser";

function App() {
  const [show, setShow] = useState(false);
  const handleClose = () => setShow(false);
  const handleShow = () => setShow(true);
  const [testID, setTestID] = useState(0);
  const [test1Cnt, setTest1Cnt] = useState(0);
  const [test2Cnt, setTest2Cnt] = useState(0);
  const [test3Cnt, setTest3Cnt] = useState(0);
  const [test4Cnt, setTest4Cnt] = useState(-1);
  const [test1Arr, setTest1Arr] = useState([
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  ]);
  const [test2Arr, setTest2Arr] = useState([
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  ]);
  const [test3Arr, setTest3Arr] = useState([
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  ]);
  const [test4Gray, setTest4Gray] = useState(0);
  const [test4ArrGray, setTest4ArrGray] = useState([]);
  const [test4Arr, setTest4Arr] = useState([]);
  const [test4ArrFinal, setTest4ArrFinal] = useState([]);
  const [resultTest1, setResultTest1] = useState("");

  /* result of Test 1 */

  let modifiedArr = [];

  for (const element of test1Arr) {
    let modifiedElement;

    if (element >= 1 && element <= 4) {
      modifiedElement = element - 1;
    } else if (element === 5) {
      modifiedElement = 2;
    } else if (element === 6 || element === 7) {
      modifiedElement = 3;
    } else {
      modifiedElement = element;
    }

    modifiedArr.push(modifiedElement);
  }

  let sumOfTest1 = modifiedArr.reduce((sum, current) => sum + current, 0);

  /* result of Test 1 */

  /* result of Test 2 */

  let modifiedArr2 = [];

  for (const element of test2Arr) {
    modifiedArr2.push(element);
  }

  let sumOfTest2 = modifiedArr2.reduce((sum, current) => sum + current, 0) - 13;

  /* result of Test 2 */

  /* result of Test 3 */

  let modifiedArr3 = [];

  for (const element of test3Arr) {
    modifiedArr3.push(element);
  }

  let sumOfTest3 = modifiedArr3.reduce((sum, current) => sum + current, 0) - 21;

  /* result of Test 3 */

  const updateElementAtIndex1 = (index, newValue) => {
    setTest1Arr((test1Arr) => {
      const newArr = [...test1Arr]; // Создаем копию массива
      newArr[index] = newValue; // Обновляем элемент с заданным индексом
      return newArr; // Возвращаем новый массив
    });
  };
  const updateElementAtIndex2 = (index, newValue) => {
    setTest2Arr((test2Arr) => {
      const newArr = [...test2Arr]; // Создаем копию массива
      newArr[index] = newValue; // Обновляем элемент с заданным индексом
      return newArr; // Возвращаем новый массив
    });
  };
  const updateElementAtIndex3 = (index, newValue) => {
    setTest3Arr((test3Arr) => {
      const newArr = [...test3Arr]; // Создаем копию массива
      newArr[index] = newValue; // Обновляем элемент с заданным индексом
      return newArr; // Возвращаем новый массив
    });
  };
  const [noAns, setNoAns] = useState(false);
  const Test1Titles = [
    "Печаль",
    "Пессимизм",
    "Ощущение несостоятельности",
    "Потеря удовольствия",
    "Чувство вины",
    "Ощущение наказанности",
    "Нелюбовь к себе",
    "Самокритичность",
    "Суицидальные мысли",
    "Слезливость",
    "Возбуждение",
    "Потеря интереса",
    "Нерешительность",
    "Бесполезность",
    "Обессиленность",
    "Изменения в шаблоне сна",
    "Раздражительность",
    "Изменения в аппетите",
    "Концентрация внимания",
    "Усталость или утомление",
    "Потеря сексуального влечения",
  ];
  const Test2Titles = [
    "Настроение",
    "Уровень оптимизма",
    "Ощущение состоятельности",
    "Интерес к другим людям",
    "Уровень решительности",
    "Восприятие внешности",
    "Удовольствие",
    "Чувство вины и несостоятельности",
    "Продуктивность",
    "Отношение к себе",
    "Жизнелюбие",
    "Усталость, утомляемость",
    "Уровень аппетита",
  ];
  const Test3Titles = [
    "Ощущение онемения или покалывания в теле",
    "Ощущение жары",
    "Дрожь в ногах",
    "Неспособность расслабиться",
    "Страх, что произойдет самое плохое",
    "Головокружение или ощущение легкости в голове",
    "Ускоренное сердцебиение",
    "Неустойчивость",
    "Ощущение ужаса",
    "Нервозность",
    "Дрожь в руках",
    "Ощущение удушья",
    "Шаткость походки",
    "Страх утраты контроля",
    "Затрудненность дыхания",
    "Страх смерти",
    "Испуг",
    "Желудочно-кишечные расстройства",
    "Обмороки",
    "Приливы крови к лицу",
    "Усиление потоотделения (не связанное с жарой)",
  ];
  const Test1Qs = [
    [
      "Мне не грустно",
      "Я чувствую печаль большую часть времени",
      "Я все время печален",
      "Я так печален и несчастлив, что не могу этого вынести",
    ],
    [
      "Я не тревожусь о своем будущем",
      "Я тревожусь о будущем больше обычного",
      "Я чувствую, что меня ничего не ждет в будущем",
      "Мое будущее безнадежно и будет еще хуже",
    ],
    [
      "Я не чувствую себя неудачником",
      "Я потерпел больше неудач, чем следовало бы",
      "Когда я оглядываюсь на свою жизнь, я вижу в ней много неудач",
      "Я чувствую, что как личность я - полный неудачник",
    ],
    [
      "Я получаю так же много удовольствия от того, чем я всегда наслаждался",
      "Я не получаю такого же удовольствия, как раньше",
      "Я получаю совсем немного удовольствия от тех вещей, которыми привык наслаждаться",
      "Я не получаю никакого удовольствия от того, чем обычно наслаждался",
    ],
    [
      "Я не чувствую себя виноватым в чем-либо",
      "Я чувствую себя виноватым за многое, что я сделал или должен был бы сделать",
      "Я чувствую себя виноватым большую часть времени",
      "Я чувствую себя виноватым все время",
    ],
    [
      "Я не чувствую, что могу быть наказанным за что-либо",
      "Я чувствую, что могу быть наказан за что-либо",
      "Я ожидаю, что буду наказан",
      "Я чувствую себя уже наказанным",
    ],
    [
      "Мое отношение к себе не изменилось",
      "Я потерял уверенность в себе",
      "Я разочарован в себе",
      "Я не люблю себя",
    ],
    [
      "Я критикую или обвиняю себя не больше, чем обычно",
      "Я более критичен к себе, чем раньше",
      "Я критикую себя за все свои ошибки",
      "Я виню себя во всем плохом, что происходит",
    ],
    [
      "Я никогда не думал покончить с собой",
      "У меня есть мысли о том, чтобы покончить с собой, но я этого не сделаю",
      "Я хотел бы покончить с собой",
      "Я бы убил себя, если бы представился случай",
    ],
    [
      "Я плачу не больше, чем обычно",
      "Я плачу больше, чем обычно",
      "Я плачу по любому незначительному поводу",
      "Мне хочется плакать, но уже не могу",
    ],
    [
      "Я не более беспокоен или взволнован, чем обычно",
      "Я чувствую себя более беспокойно или взволнованно, чем обычно",
      "Я так взволнован и обеспокоен, что мне трудно оставаться на месте",
      "Я так взволнован и взвинчен, что мне нужно двигаться или делать хоть что-нибудь",
    ],
    [
      "Я не утратил интереса к другим людям и делам",
      "Я меньше интересуюсь другими людьми и делами",
      "Я практически потерял интерес к другим людям и делам",
      "Мне тяжело заинтересоваться чем- либо",
    ],
    [
      "Я принимаю решения так же, как всегда",
      "Принятие решений дается мне труднее, чем обычно",
      "Мне гораздо труднее, чем раньше, дается принятие решений",
      "У меня есть проблемы с принятием любых решений",
    ],
    [
      "Я не чувствую себя бесполезным",
      "Я не чувствую себя таким же стоящим и полезным, как раньше",
      "Я чувствую себя менее полезным по сравнению с другими людьми",
      "Я чувствую себя совершенно никчемным",
    ],
    [
      "Я энергичен так же, как всегда",
      "У меня меньше энергии, чем обычно",
      "Мне не хватает сил на очень многое",
      "У меня ни на что не хватает сил",
    ],
    [
      "Я не испытал никаких изменений в шаблоне сна",
      "Я сплю немного больше обычного",
      "Я сплю немного меньше обычного",
      "Я сплю намного больше, чем обычно",
      "Я сплю намного меньше, чем обычно",
      "Я сплю большую часть дня",
      "Я просыпаюсь через каждый час или два",
    ],
    [
      "Я не более раздражителен, чем обычно",
      "Я более раздражителен, чем обычно",
      "Я гораздо более раздражителен, чем обычно",
      "Я всегда раздражен",
    ],
    [
      "Мой аппетит не изменился",
      "Я ем немного меньше обычного",
      "Я ем немного больше обычного",
      "Мой аппетит намного меньше, чем раньше",
      "Мой аппетит намного больше обычного",
      "У меня нет аппетита вообще",
      "Я все время хочу есть",
    ],
    [
      "Я могу сосредоточиваться так же хорошо, как всегда",
      "Я не могу сконцентрироваться так же хорошо, как обычно",
      "Мне трудно сосредоточиться на чем-то надолго",
      "Я считаю, что не могу сконцентрироваться ни на чем",
    ],
    [
      "Я не более уставший или утомленный, чем обычно",
      "Я устаю или утомляюсь легче, чем обычно",
      "Я слишком устал и утомлен, чтобы делать многое из привычных для себя вещей",
      "Я слишком устал и утомлен, чтобы делать большинство привычных дел",
    ],
    [
      "Я не заметил никаких изменений в своем интересе к сексу",
      "Секс интересует меня меньше, чем раньше",
      "Сейчас секс интересует меня гораздо меньше",
      "Я полностью потерял интерес к сексу",
    ],
  ];
  const Test2Qs = [
    [
      "Мне не грустно",
      "Мне грустно или тоскливо",
      "Мне все время тоскливо или грустно и я ничего не могу с собой поделать",
      "Мне так грустно или печально, что я не могу этого вынести",
    ],
    [
      "Я смотрю в будущее без особого разочарования",
      "Я испытываю разочарование в будущем",
      "Я чувствую, что мне нечего ждать впереди",
      "Я чувствую, что будущее безнадежно и поворота к лучшему быть не может",
    ],
    [
      "Я не чувствую себя неудачником",
      "Я чувствую, что неудачи случались у меня чаще, чем у других людей",
      "Когда оглядываюсь на свою жизнь, я вижу лишь цепь неудач",
      "Я чувствую, что потерпел неудачу как личность (родители)",
    ],
    [
      "У меня потерян интерес к другим людям",
      "Я меньше, чем бывало, интересуюсь другими людьми",
      "У меня потерян почти весь интерес к другим людям и почти нет никаких чувств к ним",
      "У меня потерян всякий интерес к другим людям, и они меня совершенно не заботят",
    ],
    [
      "Я принимаю решения примерно так же легко, как всегда",
      "Я пытаюсь отсрочить принятие решения",
      "Принятие решений представляет для меня огромную трудность",
      "Я больше совсем не могу принимать решения",
    ],
    [
      "Я не чувствую, что выгляжу сколько-нибудь хуже, чем обычно",
      "Меня беспокоит то, что я выгляжу непривлекательно",
      "Я чувствую, что в моем внешнем виде происходят постоянные изменения, делающие меня непривлекательным",
      "Я чувствую, что выгляжу гадко и отталкивающе",
    ],
    [
      "Я не испытываю никакой особенной неудовлетворенности",
      "Ничто не радует меня так, как раньше",
      "Ничто больше не дает мне удовлетворения",
      "Меня не удовлетворяет все",
    ],
    [
      "Я не чувствую никакой особенной вины",
      "Большую часть времени я чувствую себя скверным и ничтожным",
      "У меня довольно сильное чувство вины",
      "Я чувствую себя очень скверным и никчемным",
    ],
    [
      "Я могу работать примерно так же хорошо, как и раньше",
      "Мне нужно делать дополнительные усилия, чтобы что-то сделать",
      "Я не могу выполнять никакую работу",
    ],
    [
      "Я не испытываю разочарования в себе",
      "Я разочарован в себе",
      "У меня отвращение к себе",
      "Я ненавижу себя",
    ],
    [
      "У меня нет никаких мыслей о самоповреждении",
      "Я чувствую, что мне было бы лучше умереть",
      "У меня есть определенные планы совершения самоубийства",
      "Я покончу с собой при первой возможности",
    ],
    [
      "Я устаю ничуть не больше, чем обычно",
      "Я устаю быстрее, чем раньше",
      "Я устаю от любого занятия",
      "Я устал чем бы то ни было заниматься",
    ],
    [
      "Мой аппетит не хуже чем обычно",
      "Мой аппетит не так хорош, как бывало",
      "Мой аппетит теперь гораздо хуже",
      "У меня совсем нет аппетита",
    ],
  ];
  const Test3Qs = [
    [
      "Совсем не беспокоил",
      "Слегка. Не слишком меня беспокоил",
      "Умеренно. Это было неприятно, но я мог это переносить",
      "Очень сильно. Я с трудом мог это выносить",
    ],
    [
      "Совсем не беспокоил",
      "Слегка. Не слишком меня беспокоил",
      "Умеренно. Это было неприятно, но я мог это переносить",
      "Очень сильно. Я с трудом мог это выносить",
    ],
    [
      "Совсем не беспокоил",
      "Слегка. Не слишком меня беспокоил",
      "Умеренно. Это было неприятно, но я мог это переносить",
      "Очень сильно. Я с трудом мог это выносить",
    ],
    [
      "Совсем не беспокоил",
      "Слегка. Не слишком меня беспокоил",
      "Умеренно. Это было неприятно, но я мог это переносить",
      "Очень сильно. Я с трудом мог это выносить",
    ],
    [
      "Совсем не беспокоил",
      "Слегка. Не слишком меня беспокоил",
      "Умеренно. Это было неприятно, но я мог это переносить",
      "Очень сильно. Я с трудом мог это выносить",
    ],
    [
      "Совсем не беспокоил",
      "Слегка. Не слишком меня беспокоил",
      "Умеренно. Это было неприятно, но я мог это переносить",
      "Очень сильно. Я с трудом мог это выносить",
    ],
    [
      "Совсем не беспокоил",
      "Слегка. Не слишком меня беспокоил",
      "Умеренно. Это было неприятно, но я мог это переносить",
      "Очень сильно. Я с трудом мог это выносить",
    ],
    [
      "Совсем не беспокоил",
      "Слегка. Не слишком меня беспокоил",
      "Умеренно. Это было неприятно, но я мог это переносить",
      "Очень сильно. Я с трудом мог это выносить",
    ],
    [
      "Совсем не беспокоил",
      "Слегка. Не слишком меня беспокоил",
      "Умеренно. Это было неприятно, но я мог это переносить",
      "Очень сильно. Я с трудом мог это выносить",
    ],
    [
      "Совсем не беспокоил",
      "Слегка. Не слишком меня беспокоил",
      "Умеренно. Это было неприятно, но я мог это переносить",
      "Очень сильно. Я с трудом мог это выносить",
    ],
    [
      "Совсем не беспокоил",
      "Слегка. Не слишком меня беспокоил",
      "Умеренно. Это было неприятно, но я мог это переносить",
      "Очень сильно. Я с трудом мог это выносить",
    ],
    [
      "Совсем не беспокоил",
      "Слегка. Не слишком меня беспокоил",
      "Умеренно. Это было неприятно, но я мог это переносить",
      "Очень сильно. Я с трудом мог это выносить",
    ],
    [
      "Совсем не беспокоил",
      "Слегка. Не слишком меня беспокоил",
      "Умеренно. Это было неприятно, но я мог это переносить",
      "Очень сильно. Я с трудом мог это выносить",
    ],
    [
      "Совсем не беспокоил",
      "Слегка. Не слишком меня беспокоил",
      "Умеренно. Это было неприятно, но я мог это переносить",
      "Очень сильно. Я с трудом мог это выносить",
    ],
    [
      "Совсем не беспокоил",
      "Слегка. Не слишком меня беспокоил",
      "Умеренно. Это было неприятно, но я мог это переносить",
      "Очень сильно. Я с трудом мог это выносить",
    ],
    [
      "Совсем не беспокоил",
      "Слегка. Не слишком меня беспокоил",
      "Умеренно. Это было неприятно, но я мог это переносить",
      "Очень сильно. Я с трудом мог это выносить",
    ],
    [
      "Совсем не беспокоил",
      "Слегка. Не слишком меня беспокоил",
      "Умеренно. Это было неприятно, но я мог это переносить",
      "Очень сильно. Я с трудом мог это выносить",
    ],
    [
      "Совсем не беспокоил",
      "Слегка. Не слишком меня беспокоил",
      "Умеренно. Это было неприятно, но я мог это переносить",
      "Очень сильно. Я с трудом мог это выносить",
    ],
    [
      "Совсем не беспокоил",
      "Слегка. Не слишком меня беспокоил",
      "Умеренно. Это было неприятно, но я мог это переносить",
      "Очень сильно. Я с трудом мог это выносить",
    ],
    [
      "Совсем не беспокоил",
      "Слегка. Не слишком меня беспокоил",
      "Умеренно. Это было неприятно, но я мог это переносить",
      "Очень сильно. Я с трудом мог это выносить",
    ],
    [
      "Совсем не беспокоил",
      "Слегка. Не слишком меня беспокоил",
      "Умеренно. Это было неприятно, но я мог это переносить",
      "Очень сильно. Я с трудом мог это выносить",
    ],
  ];

  const lusher = {
    a01: "Потребность в покое, избегании конфликтов, установка на избегание конфликтов, сниженный фон настроения, стремление к расслаблению и отдыху. Трудности общения. Чувство непонятости и одиночества.",
    a02: "Реакция отхода от контактов в связи с тем, что отношения не складываются. Необходимо разрешение конфликтной ситуации и возможность сохранить свой социальный статус и уважение окружающих. Нуждается в стабильной обстановке, в таком виде деятельности, где нужна вдумчивость, точность и аккуратность. Ситуация вызывает недоверчивость, сопротивление внешним воздействиям, стремление оградить себя от внешнего давления и при этом сохранить свою позицию и престиж. Трезвая, рассудочная оценка ситуации. Упрямство.",
    a03: "Отход от активной деятельности и широкого круга контактов в связи с переутомлением и выраженными трудностями. Внутренняя напряженность и конфликт разнонаправленных тенденций. Мотивация достижения успеха и тенденция к независимой самореализации сталкивается с повышенным чувством усталости и ощущением непреодолимых трудностей. Напористость и самобытность, обычно способствующие достижению целей, блокированы временным снижением активности, что может быть связано с неблагоприятно сложившимися обстоятельствами или усталостью.",
    a04: "Реакция отхода от активной деятельности и широкого круга контактов в связи с переутомлением и неблагоприятной ситуацией. Потребность в эмоциональной вовлеченности и чувстве причастности к интересам референтной группы не реализуется в полной мере, что усиливает черты эмоциональной лабильности. Необходимость повышения самоконтроля создает некоторую напряженность, ощущается как тяжкое бремя, так как приходится брать на себя большую, чем этого хотелось бы, ответственность. Не реализуется в полной мере потребность в привлечении внимания окружающих к своей персоне.",
    a05: "Интровертная реакция, вызванная трудностями адаптации в социальной среде. Потребность избегания контактов широкого круга, уход в мир субъективных представлений, фантазий, мечты. Пассивно-созерцательная позиция, сензитивность, тонко нюансированная чувствительность, ирреальность притязаний и субъективизм в оценке жизненных явлений, тенденция к идеализации окружающей действительности, черты эмоциональной незрелости. Индивидуалистичность в сочетании с повышенной ранимостью, выраженная избирательность в контактах. Эстетическая ориентированность, своеобразие пристрастий.",
    a06: "Реакция отхода от контактов, напряженность, усталость, блокированность физиологических потребностей, плохое самочувствие, утрата привычного жизненного стереотипа, мнительность, болезненная сосредоточенность на плохом самочувствии. Пассивность, сочетающаяся с беспокойством, ощущение непреодолимых трудностей, потребность в избавлении от их гнета, тревожное состояние, отсутствие возможности самореализации, сниженный фон настроения. Потребность в помощи и отдыхе",
    a07: "Сочетание усталости и пассивности с выраженным чувством внутреннего протеста против сложившихся обстоятельств (судьбы), неприятие ситуации, задевающей самолюбие и блокирующей насущные потребности личности. Потребность в освобождении от гнетущих обстоятельств, несправедливости. Наряду со сниженным фоном настроения и активности — эмоции гнева.",
    a10: "Потребность в прочной и глубокой привязанности, эмоциональном комфорте и защите от внешних воздействий. Дружелюбие, конформность установок. Потребность в понимании, любви и поддержке является ведущей и поэтому наиболее легко травмируемой мишенью. Замкнутость, избирательность в контактах, аналитический склад ума, вдумчивый подход к решению проблем, инертность в принятии решений. Тормозимые черты, преобладание стремления к покою, уединенности, всплески активности быстро сменяются фазой пассивности. Вышеописанные тенденции служат инструментом достижения покоя и избавления от стресса. Выраженная склонность к ограничению контактов, расслаблению, избеганию конфликтов.",
    a12: "Потребность в прочной и глубокой привязанности, эмоциональном комфорте и защите от внешних воздействий. Дружелюбие, конформность установок. Потребность в понимании, любви и поддержке является ведущей и поэтому наиболее легко травмируемой мишенью. Замкнутость, избирательность в контактах, аналитический склад ума, вдумчивый подход к решению проблем, инертность в принятии решений. Тормозимые черты, преобладание стремления к покою, уединенности, всплески активности быстро сменяются фазой пассивности. Вышеописанные тенденции служат инструментом для достижения нормальных условий работы и взаимодействия с окружающими на основании вдумчивого, рассудительного, трезвого подхода при решении проблем. Потребность в оберегании от посягательств своей социальной позиции, повышенное чувство собственного достоинства, потребность как в самоуважении, так и сохранении личностного реноме в глазах значимых окружающих. Склонность к системному мышлению, тяга к точным сферам знаний. Деликатность в сфере межличностных контактов сочетается с упрямством в отстаивании своей позиции. Мотивация избегания неуспеха при достаточно ригидных (негибких) установках и упорстве в своих начинаниях. Черты повышенной аккуратности и внимания к деталям.",
    a13: "Конфликтное сочетание разнонаправленных тенденций — высокой мотивации избегания неуспеха и мотивации достижения. Выраженная склонность к непосредственной самореализации сталкивается со столь же высокой тенденцией к избеганию конфликтов, повышенным контролем над своими чувствами и поведением. Уравновешивая друг друга, эти тенденции создают внешне гармоничный поведенческий рисунок, чреватый физиологическими расстройствами. Эротичность в сфере влечения к противоположному полу сочетается с эмпатийностью (умением сопереживать), что может служить основой для гармоничных отношений.",
    a14: "Смешанный, эмоционально неустойчивый рисунок индивидуально-личностных свойств, выявляющий высокую подверженность внешним (средовым) воздействиям. Ранимость, чувствительность, зависимость от значимых других, повышенный самоконтроль и конформность установок сочетаются с тенденцией к легкой смене настроения и устремлений, вживаемостью в разные социальные роли. Склонность к экзальтации, потребность нравиться окружающим. Энтузиазм и стремление к сопричастности интересам референтной группы легко сменяются тенденцией уйти от излишней ответственности, участие и сопереживание более значимы, чем конкретные цели. В работе значение придается больше самому процессу, как удовлетворяющему ведущим тенденциям, чем ее окончательному результату. Большое значение придается произведенному впечатлению и дружелюбным отношениям с окружающими.",
    a15: "Пассивно-созерцательная позиция, высокая чувствительность к внешним воздействиям, тонкая нюансированность чувств во взаимоотношениях с окружающими и в оценке явлений жизни. Незрелость позиции, ранимость, трудности адаптации, избегание пут жестко ограниченных рамок деятельности. Мечтательность и поэтичность натуры, сентиментальность, эстетическая ориентированность. Нешаблонность мышления, стремление к своеобразным видам занятий и увлечений. Минорный фон настроения.",
    a16: "Пассивность позиции, черты зависимости, тревожность, неуверенность в себе, мнительность и боязливость, опасения за свое здоровье. Чувство непонятости, недостаток эмоционального тепла со стороны окружающих. Выраженная зависимость от объекта привязанности, потребность в защите и помощи.",
    a17: "Реакция пассивно-протестная (смешанный тип реагирования, характерный для лиц со склонностью к развитию физических недомоганий в ситуации эмоциональной напряженности), выраженная неустойчивость состояния, несбалансированность эмоционально-вегетативного тонуса. Неудовлетворенность и протест против сложившихся обстоятельств, сниженный фон настроения, сочетающийся с протестными реакциями. Потребность в разрешении невыносимой ситуации — и ощущение ее неразрешимости. Осознанный контроль над иррациональными (не поддающимися пониманию) поведенческими реакциями. Столкновение конфликтных мотивов, приводящее к эмоциональной напряженности, которая, не имея возможности быть отреагированной вовне, проявляется психосоматическими расстройствами.",
    a20: "Скептичность и недоверчивость, потребность в отстаивании собственных установок, упорство, противодействие обстоятельствам, которое носит защитный характер. Практичность и трезвость суждений, рационализм, тенденция к системному подходу при решении проблем. Опора на накопленный опыт. Ориентировка на собственное мнение, сопротивление внешне-средовым воздействиям. Зрелость жизненной платформы. Чувство соперничества. Значимость собственной социальной позиции. Тропизм к конкретным видам деятельности, сфере точных знаний и положению лидера в социальном окружении. Вышеописанные тенденции сталкиваются с чувством изолированности, наличия трудностей, мешающих реализации ведущей потребности. Трудности общения, проблема межличностного конфликта.",
    a21: "Скептичность, потребность в отстаивании собственных установок, упорство, противодействие обстоятельствам, которое носит защитный характер. Практичность и трезвость суждений, рационализм, тенденция к системному подходу при решении проблем. Опора на накопленный опыт. Ориентировка на собственное мнение, сопротивление внешне-средовым воздействиям. Зрелость жизненной платформы. Чувство соперничества. Значимость собственной социальной позиции. Тропизм к конкретным видам деятельности, сфере точных знаний и положению лидера в социальном окружении. Эти особенности смягчаются установкой на избегание конфликта и контролируемостью. Повышенная ранимость в отношении критических замечаний со стороны окружающих, уязвимое самолюбие, значимость социального престижа. Потребность в самоуважении и уважении со стороны окружающих. Вдумчивость, аккуратность, серьезное отношение к обязанностям, интерес к точным наукам и работе, требующей конкретных знаний, тонкого ручного выполнения, подсчета. Интерес к технике, экономике, математике или физике.",
    a23: "Амбициозность и защитно-оборонительные тенденции, высокая поисковая активность, упорство в достижении цели, выраженная тенденция к доминированию, противодействие давлению внешних факторов, самостоятельность принятия решений, предприимчивость, инициативность. Эти характеристики усилены уверенностью в себе, наступательностью тактики взаимодействия в межличностных контактах, еще более выраженными чертами независимости. Стеничность (волевая активность), стрессоустойчивость, противодействие обстоятельствам, препятствующим свободной самореализации личности, развитое чувство соперничества, увлеченность и стремление к преодолению стоящих на пути к реализации своих намерений препятствий.",
    a24: "Амбициозно-защитные тенденции, потребность в отстаивании собственных установок, упорство, противодействие обстоятельствам, которое носит защитный характер. Практичность и трезвость суждений, рационализм, тенденция к системному подходу при решении проблем. Опора на накопленный опыт. Ориентировка на собственное мнение, сопротивление внешне-средовым воздействиям. Зрелость жизненной платформы. Чувство соперничества. Значимость собственной социальной позиции. Тропизм к конкретным видам деятельности, сфере точных знаний и положению лидера в социальном окружении сочетается с такими особенностями, как выраженная надежда на успех, потребность в эмоциональной вовлеченности, в переменах, в общении. Оптимистичность, легкое вживание в разные социальные роли, демонстративность, потребность нравиться окружающим, зависимость от средовых воздействий, поиски признания и стремления к сопричастности в межличностном взаимодействии. В выборе вида деятельности наибольшее значение придается тому, чтобы сам процесс деятельности приносил удовольствие. Любые формальные рамки тесны и плохо переносятся. Непосредственность чувств, пристрастие к забавам, игровому компоненту в деятельности. Противоречивое сочетание повышенного чувства собственного достоинства и болезненного самолюбия с подвластностью средовым влияниям, ориентировкой на мнение значимых других и референтной группы. Стремление укрепить самооценку через престижность позиции и популярность среди окружения.",
    a25: "Защитные внешнеобвиняющие тенденции при затрудненной адаптации в межличностных отношениях. Наряду с трезвостью в оценках и рационализмом проявляются элементы субъективизма, сверхчувствительности к критическим замечаниям, недоверчивость, ощущение опасности в связи с недоброжелательностью некоторых людей. Мышление синтетическое, изобретательное, с художественными наклонностями и восприимчивостью к эстетике. Стремление привлечь к себе внимание, завоевать симпатии окружающих и признание своей оригинальности. Тенденция придавать особую значимость своим суждениям и высказываниям других людей. Настороженность. Обидчивость. Тенденция к построению субъективной иррациональной схемы враждебных межличностных отношений.",
    a26: "Реакция на сложившуюся ситуацию внешнеобвиняющая, обидчивая. Упорство в отстаивании своих позиций неустойчиво, наталкивается на трудности в межличностных контактах, что вызывает повышенную раздражительность, тревожную неуверенность, усталость и ухудшение самочувствия; характеристики стеничности направлены на преодоление чувства дискомфорта и неуверенности, смягчены некоторой конформностью установок. Ощущение известной приниженности своего социального престижа.",
    a27: "Реакция на сложившуюся ситуацию агрессивная, внешнеобвиняющая. Гиперстенические (сверхактивные) тенденции с выраженным чувством протеста. Ригидность установок в отстаивании своих позиций, ущемленность чувства собственного достоинства, под угрозой престижность позиции, что вызывает нарастание эмоций гнева; характеристики стеничности (активности) резко усилены противодействием среды, неблагоприятными обстоятельствами, бороться с которыми трудно в силу субъективно переживаемого чувства их неотвратимости.",
    a30: "Противоречивость тенденций, активность компенсирует невозможность полной реализации насущных потребностей. Высокая мотивация достижения, потребность в обладании жизненными благами, стремление к доминированию, нормальная эротичность, целенаправленность действий, непосредственность и раскрепощенность поведения, высокая самооценка, потребность в самореализации, противодействие обстоятельствам, препятствующим свободной самореализации личности, черты стеничности и мужественности, склонность к риску. Характеристики воли направлены на преодоление конфликта с окружением. Трудности самореализации усиливают непосредственность поведенческих реакций, но это не приносит чувства удовлетворения, увеличивает дистанцию в отношениях с окружающими и усугубляет остроту конфликта.",
    a31: "Смешанный тип реагирования, в котором конфликтно сочетаются разнонаправленные тенденции. Такие характеристики, как активность позиции, высокая мотивация достижения, потребность в обладании жизненными благами, стремление к доминированию, нормальная эротичность, целенаправленность действий, непосредственность и раскрепощенность поведения, высокая самооценка, потребность в самореализации, противодействие обстоятельствам, препятствующим свободной самореализации личности, черты стеничности и мужественности, склонность к риску используются как инструмент достижения гармоничных и доброжелательных отношений с окружающими, особенно в дружеских и интимно-эротических контактах. Внешне уравновешенное поведение дается ценой известного напряжения с тенденцией к раскачиванию вегетативного баланса и физическим недомоганиям, мишенью которых является сердце.",
    a32: "Активность, высокая мотивация достижения, потребность в обладании жизненными благами, стремление к доминированию, нормальная эротичность, целенаправленность действий, непосредственность и раскрепощенность поведения, высокая самооценка, потребность в самореализации, противодействие обстоятельствам, препятствующим свободной самореализации личности, черты стеничности и мужественности, склонность к риску сочетаются с такими тенденциями, как скептичность и внешнеобвиняющие реакции, потребность в отстаивании собственных установок, упорство, противодействие обстоятельствам, которое носит защитный характер. Практичность и трезвость суждений, рационализм, тенденция к системному подходу при решении проблем. Опора на накопленный опыт. Ориентировка на собственное мнение, сопротивление внешне-средовым воздействиям. Зрелость жизненной платформы. Чувство соперничества. Значимость собственной социальной позиции. Тропизм к конкретным видам деятельности, сфере точных знаний и положению лидера в социальном окружении. Стрессоустойчивость, стремление к престижной позиции, доминированию. Склонность к вспыльчивости в конфликтных ситуациях.",
    a34: "Активность, высокая мотивация достижения, потребность в обладании жизненными благами, стремление к доминированию, нормальная эротичность, целенаправленность действий, непосредственность и раскрепощенность поведения, высокая самооценка, потребность в самореализации, противодействие обстоятельствам, препятствующим свободной самореализации личности, Черты стеничности и мужественности, склонность к риску сочетаются с неустойчивостью эмоционального состояния, тенденция к самореализации — с изменчивостью установок и непоследовательностью. Яркость эмоциональных реакций, экзальтация чувств, широкий спектр увлечений, оптимис-тичность, выраженная общительность, поиски новых контактов и сфер интересов. Самооценка неустойчива, наряду с высоким уровнем притязаний неуверенность в себе, которая легко переходит в другую крайность в ситуации признания и успеха в глазах окружения.",
    a35: "Активность самореализации, высокая мотивация достижения, потребность в обладании жизненными благами, стремление к доминированию, нормальная эротичность, целенаправленность действий, непосредственность и раскрепощенность поведения, высокая самооценка, противодействие обстоятельствам, препятствующим свободной самореализации личности, черты стеничности и мужественности, склонность к риску сочетаются с чертами эмоциональной незрелости, индивидуалистичностью, повышенным стремлением к независимой позиции, ирреальностью завышенных притязаний. Нетривиальный подход к решению проблем, оригинальность, некоторая склонность к рисовке, стремление привлечь внимание к себе и вовлечь в сферу своего обаяния тех, чье мнение значимо. При достаточно высоком интеллекте данный эмоционально-динамический рисунок представляет собой оптимальные условия для проявления творческих способностей.",
    a36: "Активность, высокая мотивация достижения, потребность в обладании жизненными благами, стремление к доминированию, нормальная эротичность, целенаправленность действий, непосредственность и раскрепощенность поведения, высокая самооценка, потребность в самореализации, противодействие обстоятельствам, препятствующим свободной самореализации личности, черты стеничности и мужественности, склонность к риску — все эти тенденции сталкиваются с напряженностью физиологических потребностей, чувством общего дискомфорта, утратой привычного жизненного стереотипа. Высокая активность направлена на поиски выхода из неблагоприятной ситуации, которая оказывает фрустрирующее воздействие, препятствует реализации намерений и ущемляет личностный престиж. Дискомфорт вызывает напряженность биологических потребностей, повышенную тревожность, потребность в расслаблении, успокоении.",
    a37: "Высокая мотивация достижения, потребность в обладании жизненными благами, стремление к доминированию, нормальная эротичность, целенаправленность действий, непосредственность и раскрепощенность поведения, высокая самооценка, потребность в самореализации, противодействие обстоятельствам, препятствующим свободной самореализации личности, черты стеничности (активности) и мужественности, склонность к риску. Повышенная активность связана с протестной гиперстенической реакцией, стремлением к независимости, отстаиванием своих индивидуалистических устремлений от давления авторитетов. Импульсивность поведения, пренебрежение условностями. Трудности социальной адаптации. Склонность к протестным поведенческим реакциям. Агрессивность.",
    a40: "Потребность в действии, эмоциональной вовлеченности, в переменах, в общении сталкивается с препятствиями, что создает чувство повышенной усталости, затруднения в контактах с окружающими. Эмоциональная неустойчивость, легкое вживание в разные социальные роли, демонстративность, потребность нравиться окружающим .— Все эти характерные черты акцентированы в связи с повышенной зависимостью от средовых воздействий, поисками признания и стремлением к сопричастности в межличностном взаимодействии. Тенденция к избеганию ответственности. В выборе вида деятельности наибольшее значение придается тому, чтобы сам процесс деятельности приносил удовольствие. Любые формальные рамки тесны и плохо переносятся. Выраженная эмоциональная переключаемость без глубины переживаний и непостоянство в привязанностях. Непосредственность чувств, пристрастие к забавам, игровому компоненту в деятельности. Все это — вопреки трудностям, отсутствию поддержки и помощи со стороны окружающих, неопределенности ситуации. Смутное ощущение тревожности, вытеснение проблем. Эмоциональная напряженность, причины которой практически не осознаются.",
    a41: "Неустойчивость фона настроения, противоречивость реакций, непосредственно связанная с противодействием разнонаправленных тенденций. Потребность в действии, эмоциональной вовлеченности, в переменах, в общении. Оптимистичность, эмоциональная неустойчивость, легкое вживание в разные социальные роли, демонстративность, потребность нравиться окружающим, зависимость от средовых воздействий, поиски признания и стремления к сопричастности в межличностном взаимодействии. Тенденция к избеганию ответственности. В выборе вида деятельности наибольшее значение придается тому, чтобы сам процесс деятельности приносил удовольствие. Любые формальные рамки тесны и плохо переносятся. Выраженная эмоциональная переключаемость без глубины переживаний и непостоянство в привязанностях. Непосредственность чувств, пристрастие к забавам, игровому компоненту в деятельности сочетаются с такими свойствами? как потребность в прочной и глубокой привязанности, эмоциональном комфорте и защите от внешних воздействий. Дружелюбие, конформность установок. Потребность в понимании? любви и поддержке является ведущей и поэтому наиболее легко травмируемой мишенью. Отсюда некоторая избирательность в контактах, аналитический склад ума, менее беспечный подход к решению проблем, временами стремления к покою, уединенности, всплески активности быстро сменяются фазой пассивности — что создает почву для внутреннего конфликта, в ситуации личностно значимой ведущими являются тенденции стенического круга и проявляется повышенная эмотивность. В социально значимой ситуации эти свойства успешно контролируются. Склонность к перепадам в настроении — от приподнятого, экзальтированного до грустного. Выраженная зависимость от средовых воздействий и от ситуации успеха-неуспеха.",
    a42: "Надежда на успех и выраженная эмотивность сочетаются с педантизмом. Преобладают такие характеристики как потребность в действии, эмоциональной вовлеченности, в переменах, в общении, оптимистичность, эмоциональная неустойчивость, легкое вживание в разные социальные роли, демонстративность, потребность нравиться окружающим, зависимость от средовых воздействий, поиски признания и стремления к сопричастности в межличностном взаимодействии, тенденция к избеганию ответственности, в выборе вида деятельности ориентированность на то, чтобы сам процесс деятельности приносил удовольствие. Любые формальные рамки тесны и плохо переносятся. Выраженная эмоциональная переключаемость без глубины переживаний и непостоянство в привязанностях. Непосредственность чувств, пристрастие к забавам, игровому компоненту в деятельности. Эти черты усиливаются такими тенденциями, как упрямство, практичность, потребность в отстаивании собственных установок, упорство, агрессивность, которая носит защитный характер. Трезвость суждений, рационализм, тенденция к системному подходу при решении проблем. Опора на накопленный опыт. Ориентировка на собственное мнение, сопротивление внешне-средовым воздействиям. Зрелость жизненной платформы. Чувство соперничества. Значимость собственной социальной позиции. Тропизм к конкретным видам деятельности, сфере точных знаний и положению лидера в социальном окружении. Неустойчивость и ригидность в сочетании могут взаимно уравновешивать друг друга при хорошем контроле достаточно высокого интеллекта. Широта диапазона интересов и высокая поисковая активность в содружестве с тенденцией к планомерности в принятии решений и действиях способствуют эффективной деятельности. При недостаточной личностной интеграции — повышенная конфликтность. Проблема личности, «ищущей признания».",
    a43: "Такие характеристики, как потребность в действии, в эмоциональной вовлеченности, в переменах, в общении, оптимистичность и легкое вживание в разные социальные роли, демонстративность, стремление нравиться окружающим, зависимость от средовых воздействий, поиски признания и стремления к сопричастности в межличностном взаимодействии, тенденция к избеганию ответственности, стремление придавать наибольшее значение тому, чтобы сам Процесс деятельности приносил удовольствие, трудности адаптации в условиях жесткого регламента, при выраженной эмоциональной переключаемости и непостоянстве в привязанностях, непосредственности чувств, пристрастии к забавам и игровому компоненту в деятельности усиливаются такими свойствами; как активность позиции, высокая мотивация достижения, потребность в обладании жизненными благами, стремление к доминированию, нормальная эротичность, непосредственность и раскрепощенность поведения, высокая самооценка, потребность в самореализации, противодействие обстоятельствам, препятствующим свободной самореализации личности, черты стеничности и мужественности, склонность к риску. Непоследовательность, своеволие, повышенное чувство авторитарности. Тенденция к самореализации при повышенной эмотивности, склонности разбрасываться, браться сразу за несколько дел.",
    a45: "Эмоциональная неустойчивость, повышенная эмотивность. Потребность в общении* эмоциональной вовлеченности, в переменах, в признании. Оптимистичность, легкое вживание в разные социальные роли, демонстративность, потребность нравиться окружающим, зависимость от средовых воздействий, поиски признания и стремление к сопричастности в межличностном взаимодействии. Тенденция к избеганию ответственности. В выборе вида деятельности наибольшее значение придается тому, чтобы сам процесс деятельности приносил удовольствие. Любые формальные рамки тесны и плохо переносятся. Выраженная эмоциональная переключаемость без глубины переживаний и непостоянство в привязанностях. Непосредственность чувств, пристрастие к забавам, игровому компоненту в деятельности — все это усугубляется ирреальностью притязаний, чертами эмоциональной незрелости, трудностями социальной адаптации. Художественный склад мышления, элементы артистизма в поведении, потребность в сильных переживаниях, богатое воображение, повышенная ранимость, впечатлительность, мечтательность. Склонность к выбору занятий в сфере искусства и избеганию рамок режимных видов деятельности и формальностей.",
    a46: "Реакция эмоциональной неустойчивости в ситуации переутомления или утраты привычного жизненного стереотипа. Потребность в общении, эмоциональной вовлеченности, в переменах усилена в связи с ситуацией, в которой ощущается общий дискомфорт и чувство приниженности. Оптимистичность, эмоциональная неустойчивость, легкое вживание в разные социальные роли, демонстративность, потребность нравиться окружающим, зависимость от средовых воздействий, поиски признания и стремления к сопричастности в межличностном взаимодействии. Тенденция к избеганию ответственности. Б ьыборе вида деятельности наибольшее значение придается тому, чтобы сам процесс деятельности приносил удовольствие. Любые формальные рамки тесны и плохо переносятся. Выраженная эмоциональная переключаемость без глубины переживаний и непостоянство в привязанностях. Непосредственность чувств, пристрастие к забавам, игровому компоненту в деятельности. Состояние эмоциональной напряженности, физическая усталость, дискомфорт. Эмоциональная неустойчивость усугубляется недомоганием, опасениями за свое здоровье, тревожными ощущениями надвигающейся опасности. Потребность в избавлении от проблем. Вытеснение психологических причин и соматизация конфликта. Напряженность физиологических потребностей.",
    a47: "В силу неприемлемых обстоятельств, вызывающих протест и негативизм, резко усилены такие свойства личности, как потребность в общении, эмоциональной вовлеченности, в переменах, поиски признания. Оптимистичность, эмоциональная неустойчивость, легкое вживание в разные социальные роли, демонстративность, потребность нравиться окружающим, зависимость от средовых воздействий, поиски признания и стремление к сопричастности в межличностном взаимодействии. Тенденция к избеганию ответственности. В выборе вида деятельности наибольшее значение придается тому, чтобы сам процесс деятельности приносил удовольствие. Любые формальные рамки тесны и плохо переносятся. Выраженная эмоциональная переключаемость без глубины переживаний и непостоянство в привязанностях. Непосредственность чувств, пристрастие к забавам, игровому компоненту в деятельности. Выраженная эмоциональная напряженность. Стремление уйти от проблем и ответственности сталкивается с серьезным препятствием, вызывающим чувство протеста. Непосредственность поступков и высказываний может быть поспешной и опережать их продуманность. Активные поиски выхода из ситуации избыточно суетливы, непоследовательны, непланомерны.",
    a50: "Трудности социальной адаптации у личности своеобразной, избирательной в контактах, оторванной от реальности повседневной жизни. Пассивно-созерцательная позиция, иррациональный способ защиты от стресса и межличностных конфликтов. Потребность в отстаивании своего индивидуального стиля путем пассивного сопротивления г уходом ъ мир идеальных субъективных представлений и переживаний, в мир фантазий и мечты.",
    a51: "Неустойчивость, трудности социальной адаптации, эмоциональности и субъективность пристрастий превалирует над рассудочностью.-Нр шаблонный, самобытный подход к решению проблем, оригинальности мышления, богатое воображение, недостаток практицизма, реалистичности. Индивидуалистичность, создающая трудности в попытках завязывания контактов. Ранимость, сензитивность. Трудно вырабатываются навыки общепринятых норм поведения. Тонкая нюансированность чувств, своеобразие интересов, суждений сочетается с такими особенностями, как потребность в прочной и глубокой привязанности, эмоциональном комфорте и защите от внешних воздействий. Дружелюбие, конформность установок. Потребность в понимании, любви и поддержке является ведущей и поэтому наиболее легко травмируемой мишенью. Замкнутость, избирательность в контактах, аналитический склад ума, вдумчивый подход к решению проблем, инертность в принятии решений. Тормозимые черты, преобладание стремления к покою, уединенности, всплески активности быстро сменяются фазой пассивности. Эстетическая ориентированность, уход от житейских проблем в мир искусства, поэзию, мир фантазий.",
    a52: "Трудности социальной адаптации. Повышенная обидчивость. Трудности межличностных отношений, смешанный тип реагирования, сензитивность к критическим замечаниям со стороны окружающих, недоверчивость. Изобретательный склад ума, нешаблонность решений сочетается с тенденцией к систематизации, иррациональность чувств с трезвостью суждений. Подозрительность, повышенное чувство справедливости, стремление настоять на своем. Потребность j признании своего авторитета в глазах окружающих",
    a53: "Трудности социальной адаптации в силу повышенной сензитивности и выраженной индивидуалистичности. Неустойчивость мотивационной направленности. Повышенная эмотивность, потребность в самореализации при недостаточно развитом контроле. Экзальтированность. Нешаблонный подход к решению проблем, склонность к расширению сферы интересов, увлеченность. Стремление привлечь внимание окружающих, высокий уровень притязаний, избирательность в контактах, своеобразие интересов. Адаптация затрудняется в жестко регламентированной ситуации и в контактах с людьми категоричными и нетерпимыми.",
    a54: "Трудности социальной адаптации в силу повышенной чувствительности и выраженного индивидуализма. Выраженная эмоциональная неустойчивость, быстрая переключаемость внимания, легкое вживание в разные социальные роли. Артистизм, экзальтированность, иррациональность притязаний. Высокий, но неустойчивый уровень самооценки, на которую оказывает влияние мнение окружающих, отсюда повышенная потребность в признании, элементы демонстративности. Развитое воображение, богатая фантазия, художественный стиль восприятия. Черты эмоциональной незрелости. Благоприятная почва для развития творческой одаренности.",
    a56: "Состояние тревожное, неустойчивое, обостренная чувствительность к средовым воздействиям, трудности адаптации, связанные с индивидуальным своеобразием и известным идеализмом. Выраженная избирательность в отношении жизненных ценностей, в контактах с людьми. Сужена зона жизненного комфорта: потребность в щадящих условиях, прихотливость вкуса. Повышенная мнительность, болезненная сосредоточенность на своих ощущениях, склонность к страхам.",
    a57: "Протестно-негативная иррациональная реакция на ситуацию. Эмоциональная напряженность, трудности адаптации, чувство неудовлетворенности в связи с обстоятельствами, субъективно оцениваемыми как навязанные и нежелательные. Потребность в сохранении собственного стиля самореализации фрустрирована, способы решения проблем носят иррациональный характер, однако поступки и высказывания не столь агрессивны, сколь своеобразны. Ощущение диссонанса с окружением, неэтичности происходящего вокруг. Столкновение идеальных представлений с грубой реальностью.",
    a60: "Выраженная потребность в отдыхе, состояние тревоги, беспокойство, переживание конфликта, усталость, перенапряжение. Тревожные опасения за свое здоровье. Проблемы субъективно переживаются как трудно преодолимые. Страх перед будущим. Потребность в понимании и защите от стрессов, в покое и расслаблении. Повышенная чувствительность к средовым воздействиям. Стремление освободиться от избыточной и обременительной ответственности, снижение социальной активности. Страх перед надвигающейся опасностью и трудностями.",
    a61: "Потребность в избавлении от усталости и конфликтов. Повышенная тревожность, страх одиночества. Потребность в помощи, понимании, теплых отношениях и поддержке. Физическое переутомление, ухудшение самочувствия. Избыточный самоконтроль, гиперсоциальность установок, ориентация на общепринятые нормы поведения как защита от конфликтов с окружающими. Зависимость от объекта аффилиативной привязанности. Зажатость, отсутствие спонтанности поступков и высказываний. Повышенные требования к себе и окружающим в вопросах морали.",
    a62: "Проблема сдерживаемой раздражительности. Предрасположенность к физиологическим расстройствам. Повышенная утомляемость, перенапряжение контролирующих систем. Потребность в расслаблении и отдыхе, избавлении от напряженных отношений, переживаемых как враждебный настрой окружающих лиц, недоброжелательность с их стороны. Большие усилия затрачиваются на сдерживание собственных эмоций раздражения и обиды. Раздражает отсутствие привычного стереотипа.",
    a63: "Напряженность физиологических потребностей, неудовлетворенная чувственность. Проблема сдерживания спонтанной (непосредственной) самоактуализации, собственной авторитарности во избежание нарастания конфликта и для сохранения объекта привязанности. Повышенная нервозность, неуверенность в себе. Непривычная обстановка, выбивающая из колеи.",
    a64: "Состояние эмоциональной напряженности, неустойчивость фона настроения, повышенная тревожность. Стремление уйти от сложностей, избавиться от гнетущего чувства ответственности. Потребность в ограничении круга обязанностей, страх перед трудностями, опасения за свое здоровье; потребность в расслаблении и отдыхе, удобной и комфортной обстановке.",
    a65: "Напряженность физиологических потребностей, неудовлетворенность, дискомфорт. Выраженная избирательность в вопросах вкуса, потребность в особых условиях, разборчивость, причудливость выбора. Трудности адаптации к новым условиям. Повышенная чувствительность к средовым воздействиям.",
    a67: "Эмоциональная напряженность, физиологический дискомфорт, потребность в покое. Ситуация воспринимается как трудно разрешимая. Горечь разочарования, неудовлетворенность собой, избыточная самокритичность. Пассивный протест против сложившихся обстоятельств.",
    a70: "Негативно-протестная реакция, напряженность, стресс. Пессимистическая оценка ситуации. Сопротивление внешним обстоятельствам, давлению средовых воздействий. Стремление отстоять собственную позицию ограничением контактов, пассивным противодействием. Аутичность, отход от привычного круга контактов. Неудовлетворены ведущие потребности",
    a71: "Состояние характеризуется выраженной неустойчивостью. Протестная реакция на обстоятельства, нарушающие покой, затрудняющие самореализацию личности, не может в полной мере проявиться в поведении и высказываниях из-за подключившегося контроля над эмоциями. Вегето-эмоциональная неустойчивость усиливается в связи с блокированностью потребностей, которые обозначены ниже. Раздражительная слабость, функциональные нарушения психосоматического круга.",
    a72: "Протестная реакция в ответ на убежденность в недоброжелательности значимых окружающих или их попытки ограничить действия и самостоятельность обследуемого лица. Упорство в отстаивании собственного мнения и своей независимости. Внешнеобвиняющий тип реагирования. Акцентированы черты недоверчивости. Склонность к формированию жесткой субъективной схемы конфликтных межличностных отношений.",
    a73: "Протестная реакция на средовые воздействия с избыточной возбудимостью. Повышенная импульсивность. Склонность к неожиданным своевольным поступкам в состоянии аффекта. Возможны деструктивные агрессивные тенденции.",
    a74: "Протестная реакция в ситуации выраженной эмоциональной напряженности. Негативизм в отношении средовых воздействий сочетается с эмоциональной неустойчивостью, иррациональными страхами. Потребность в избавлении от непереносимой ситуации может спровоцировать необдуманные импульсивные высказывания. Отчаянные поиски выхода из ситуации трудно прогнозируемы и могут проявиться в аутоагрессивной (направленной на себя) форме и других иррациональных поступках на фоне сниженного инстинкта самосохранения.",
    a75: "Негативная реакция на ситуацию личности своеобразной, ориентированной лишь на собственное субъективное мнение. Ирреальные требования к жизни, потребность в идеалах, которые не могут быть воплощены в реальность. Категоричность и необычность суждений, жесткость позиции, невозможность каких-либо компромиссов в отношениях с окружающими, убежденность в своей исключительности, пренебрежение к общепринятым канонам. Склонность к иррациональным решениям. Проявления социальной дезадаптации.",
    a76: "Состояние выраженной социально-психологической дезадаптации. Ощущение разочарования, диссонанса между идеальными представлениями и грубой реальностью. Потребность в покое и расслаблении, освобождении от стресса. Неприятие ситуации, протест, непримиримость. Перенапряжение физическое и душевное. Тревожная и болезненная оценка своего самочувствия.",
    b01: "Несмотря на сложность ситуации, предпринимаются упорные попытки для достижения целей. Действия планомерны, продуманы, осторожны.",
    b02: "Несмотря на сложность ситуации, предпринимаются упорные попытки для достижения целей. Действия планомерны, продуманы, осторожны.",
    b03: "Мотивация достижения блокирована препятствиями и трудностями. Напряженность контролирующих спонтанность «тормозных» механизмов проявляется повышенной тревожностью и раздражительностью.",
    b04: "Неустойчивость состояния, затрудняющая целенаправленность поведения, создает эмоциональную напряженность.",
    b05: "Пассивность и осторожность мешают гармонизации отношений, которым придается идеальная окраска.",
    b06: "Пассивность, зависимость от значимых других, ощущение приниженности. Потребность в большей безопасности, в теплых отношениях, избавлении от проблем.",
    b07: "Состояние стресса в связи со сложившейся ситуацией. Трудности самореализации, ограничение независимости, стеснение свободы выбора решений. Стремление освободиться от помех.",
    b10: "Дружелюбие и конформность, контролируемость чувств и поступков, избирательность в контактах, необходима спокойная обстановка.",
    b12: "Упорядоченность, методичность и самостоятельность действий. Потребность в сочувствии и понимании, самоуважении и уважении со стороны значимых окружающих.",
    b13: "Склонность к плодотворному сотрудничеству без притязаний на лидирующую позицию. Умение сглаживать конфликты, сдерживать собственные непосредственные реакции. Хороший самоконтроль при достаточной активности.",
    b14: "Подверженность средовым влияниям, потребность в сопричастности. Стремление к вживанию в разные социальные роли. Колебания настроения в зависимости от степени принятия окружением, успешности своих действий.",
    b15: "Сензитивность, эстетическая ориентированность, потребность в гармоничных отношениях, теплой привязанности.",
    b16: "Потребность в избегании лишних усилий, уюте, безопасности и теплых отношениях. Необходим покой и защищенность.",
    b17: "Неустойчивость. Осознанный контроль над спонтанными реакциями создает известную напряженность. Неуверенность в себе, в связи с этим повышенная ранимость, болезненное чувство уязвленного самолюбия делают поведение неровным.",
    b20: "Оборонительная реакция в связи с ощущением угрозы, затруднениями в реализации своих планов. Тревожные опасения усиливают решимость довести дело до конца.",
    b21: "Аккуратность, методичность и самостоятельность в деятельности. Потребность в самоуважении и уважении со стороны значимых других.",
    b23: "Актуализация лидерских тенденций, упорство в преодолении трудностей, напряженность и чувство соперничества.",
    b24: "Обстоятельства способствуют неустойчивости самооценки, требуют самоутверждающегося поведения. Стремление повысить свою значимость в глазах окружающих.",
    b25: "Стремление преодолеть предубеждение и недоброжелательность окружающих; настороженность и недоверчивость во взаимоотношениях в связи с тенденцией к преувеличению значимости их мнения, сензитивность к критическим замечаниям. Упрямство и своеволие, возводимые в принцип. Изобретательность и богатство фантазии.",
    b26: "Раздражительность, мнительность в отношении высказываний окружающих на свой счет, упрямство в сочетании с обидчивостью. Проблема уязвленного самолюбия и нарушенного равновесия в отношениях с окружающими.",
    b27: "Упорство в отстаивании своей позиции, отсутствие склонности к компромиссам, упрямство и несговорчивость.",
    b30: "Повышенная импульсивность, раздражительность. Состояние, близкое к стрессу. Активность не приводит к решению проблем и усугубляет конфликт.",
    b31: "Активность в преодолении трудностей, доминантность в отношениях с окружающими, стремление к лидирующей позиции, вспыльчивость в конфликтных ситуациях.",
    b32: "Активность в преодолении трудностей, доминантность в отношениях с окружающими, стремление к лидирующей позиции, вспыльчивость в конфликтных ситуациях.",
    b34: "Общительность, непостоянство в привязанностях, легкая переклю-чаемость на другие виды деятельности, что может привести к поверхностности. Откликаемость на средовые воздействия, чувствительность к изменениям микроклимата в социуме.",
    b35: "Стремление к независимой позиции, оригинальность суждений, своеобразие интересов, увлеченность, потребность в «особых» переживаниях и отношениях, которым отдается предпочтение перед конкретными реальными целями.",
    b36: "Нежелание проявлять предприимчивость и практицизм, стремление к безопасности и комфорту, отсутствие выраженного честолюбия.",
    b37: "Самореализация и достижение цели затруднены из-за существенных препятствий, что способствует усилению стеничности.",
    b40: "Трудности выбора пути решения проблем, известная напряженность, причины которой не осознаются.",
    b41: "Податливость влиянию окружающих, изменчивость настроения в зависимости от реакций находящихся рядом людей. Стремление к установлению дружеских контактов. Самооценка зависит от успеха и мнения значимых других.",
    b42: "Актуальность надежды на повышение социального статуса и материальной обеспеченности.",
    b43: "Активность, переходящая в разбросанность, торопливость. Раздражительность, вызванная медленным ходом событий. Переменчивость и недостаток целенаправленной настойчивости в достижении целей.",
    b45: "Богатое воображение, яркость чувств, потребность в необычных приключениях, интересных знакомствах, волнующих событиях, вызывающих заинтересованность и энтузиазм.",
    b46: "Неустойчивость, неуверенность в себе, боязливость, тревожные опасения непреодолимости существующих проблем; истинная причина конфликта — внутренняя — не осознается.",
    b47: "Активные, но недостаточно целенаправленные поиски разрешения конфликтной ситуации, истоки которой не полностью осознаны. Избыточная эмотивность мешает рассудочно подойти к проблеме. Поступки лишены планомерности и продуманности, решения могут быть опрометчивы, иррациональны.",
    b50: "Тревожная настороженность, пассивное выжидание, уход от конфликтов и непонимания окружающими в мир внутренних переживаний, мечты и фантазий, бегство от повседневности, стремление быть собой, сохранить индивидуальность. Избирательность в контактах.",
    b51: "Потребность в теплых отношениях, любви и понимании. Сентиментальность, идеализация объекта привязанности, эстетическая ориентированность. Застенчивость, бегство от житейских проблем в мир искусства и теплых межличностных отношений.",
    b52: "Недоверчивость, переживание чувства обиды, стремление улучшить впечатление о себе в глазах значимых окружающих. Сензитивность в отношении критических замечаний в свой адрес. Иррациональные способы противодействия недоброжелательности окружающих. Склонность преувеличивать враждебность отношения к себе других. Изобретательность и богатство фантазии. Стремление упрочить свою позицию.",
    b53: "Экспансивность высказываний и поведения, эмоциональная вовлеченность, стремление к переживанию сильных ощущений. Оригинальность и творческий подход в решениях. Настойчивость в отстаивании собственной индивидуальности, что несколько усложняет адаптацию.",
    b54: "Стремление к независимости позиции, оригинальность суждений, своеобразие интересов. Потребность в «особых» переживаниях и отношениях, которым отдается предпочтение перед конкретными и реальными целями.",
    b56: "Обостренная чувствительность к средовым воздействиям. Сужена зона жизненного комфорта. Потребность в дифференцированном, щадящем подходе. Избирательность, капризность, стремление к удовлетворению своих прихотливых вкусов.",
    b57: "Категоричность и субъективизм суждений в оценке ситуации, настойчивость в нереальных требованиях. Бескомпромиссность в отстаивании своеобразных убеждений. Ощущение своей непонятости, одиночества.",
    b60: "Пассивность, зависимость от значимых других, ощущение приниженности. Потребность в большей безопасности, теплых отношениях, избавлении от проблем.",
    b61: "Раздражительность, мнительность в отношении высказываний окружающих на свой счет, упрямство в сочетании с обидчивостью. Проблема уязвленного самолюбия и нарушенного равновесия в отношениях с окружающими.",
    b62: "Раздражительность, мнительность в отношении высказываний окружающих на свой счет, упрямство в сочетании с обидчивостью. Проблема уязвленного самолюбия и нарушенного равновесия в отношениях с окружающими.",
    b63: "Ощущение избытка трудностей и бесполезности дальнейших усилий. Стремление к безопасности и комфорту. Отказ от реализации честолюбивых планов ценою потери спокойствия.",
    b64: "Неустойчивость состояния, неуверенность в себе, боязливость, тревожное ощущение непреодолимости препятствий. Стремление к устойчивому положению, уюту и спокойствию за счет активности других лиц, без затраты собственных усилий.",
    b65: "Обостренная чувствительность к средовым воздействиям. Сужена зона жизненного комфорта. Потребность в индивидуализированном и бережном подходе. Избирательность, капризность, стремление к удовлетворению своих прихотливых вкусов.",
    b67: "Эмоциональное и физическое перенапряжение, тенденция к самоуничижению, чувство приниженности. Потребность в покое и помощи.",
    b70: "Противодействие сложившейся ситуации, пессимистический настрой, стремление освободиться от напряженности, отстоять собственную позицию ограничением контактов.",
    b71: "Неустойчивость состояния, раздражительность в ответ на ситуацию, нарушающую покой и затрудняющую контакты. Чувствительность к средовым воздействиям; потребность в понимании, затрудненная выраженной избирательностью в межличностных контактах, обидчивостью.",
    b72: "Упорное отстаивание своего мнения, неуступчивость, категоричность в отстаивании собственной независимости, уверенность в своей правоте. Внешнеобвиняющая реакция на неблагоприятную ситуацию.",
    b73: "Самореализация и действия, направленные на достижения цели, затруднены из-за существенных препятствий, что вызывает усиление стенических реакций.",
    b74: "Активность носит недостаточно целенаправленный характер, что затрудняет разрешение конфликтной ситуации, истоки которой не полностью осознаются. Избыточная эмотивность мешает рассудочному овладению ситуацией. Поступки лишены планомерности и продуманности, решения могут быть опрометчивы, иррациональны.",
    b75: "Субъективизм и категоричность в оценке ситуации, неуступчивость в отстаивании своей независимости, своеобразных убеждений. Ощущение своей непонятости, одиночества.",
    b76: "Эмоциональное и физическое перенапряжение, чувство приниженности. Потребность в покое и помощи.",
    c01: "Избирательность в контактах, обособленность, стремление избегать глубоких привязанностей, чтобы не испытывать разочарования. Сосредоточенность на своих проблемах.",
    c02: "Настороженность, выжидательная позиция, попытка примириться с существующей ситуацией и найти в ней новые возможности.",
    c03: "Тревожные опасения, вынужденная сдержанность, контроль над поведением, стремление к избеганию конфликта.",
    c04: "Во избежание конфликтов проявляется тенденция к сдерживанию непосредственных реакций и ярких эмоциональных всплесков, позволительных лишь в контактах узкого круга.",
    c05: "Повышенная обидчивость, связанная с эгоцентричностью.",
    c06: "Потребность в большей эмоциональной вовлеченности, эротичность.",
    c07: "Вынужденная необходимость пойти на компромисс ради сохранения добрых отношений с окружающими.",
    c10: "Потребность в эмоциональной вовлеченности, носящей поверхностный характер.",
    c12: "Неудовлетворенная потребность в самоуважении и уважении со стороны значимых других. Напряженность взаимоотношений с близкими людьми.",
    c13: "Трудности в достижении сотрудничества и гармоничных отношений.",
    c14: "Затруднения в попытке контролировать повышенную эмотивность, недостаточно учитывается ситуация и мнение окружающих.",
    c15: "Трудности в межличностных контактах из-за повышенной ранимости и сосредоточенности на своих проблемах.",
    c16: "Застенчивость и пассивность, затрудняющие чувственную раскованность.",
    c17: "Уступчивость и пассивность, мешающие сохранить эмоциональную привязанность.",
    c20: "Тенденция скрыть свою неуверенность и стремление к избеганию конфликтов.",
    c21: "Уступчивость, обусловленная тем, что проявление упорства не уместно при сложившихся обстоятельствах. Напряженность в контактах узкого круга.",
    c23: "Стремление к сохранению миролюбивых отношений с окружающими, несмотря на внутренний протест.",
    c24: "Несмотря на трудности и препятствия, гибкость позиции способствует целенаправленности действий.",
    c25: "Тщательно скрываемая обидчивость, стремление занять гибкую и уступчивую позицию.",
    c26: "Стремление примириться с трудностями и найти оптимальную зону комфорта.",
    c27: "Сдержанность в эмоциональных проявлениях, отказ от своих притязаний, уступчивость, обусловленная сложившимися обстоятельствами.",
    c30: "Ощущение непреодолимости препятствий, что вызывает потребность в покое",
    c31: "Трудности достижения гармоничных отношений с окружающими создают чувство изолированности, дистресса.",
    c32: "Препятствия и трудности вызывают чувство несчастливости и вынуждают примириться с ситуацией.",
    c34: "Потребность в поддержке и одобрении, спокойной обстановке, что позволило бы расширить сферу контактов и надеяться на лучшее в будущем.",
    c35: "Эгоцентрическая сосредоточенность на своих огорчениях и обидах.",
    c36: "Поиски выхода из сложной ситуации. Удовлетворенность физиологических потребностей.",
    c37: "Ситуация вынуждает к сдержанности и подавлению сиюминутных потребностей.",
    c40: "Потребность в общении при выраженной избирательности в межличностных контактах. Неуверенность в себе и стремление к избеганию конфликтов.",
    c41: "Избирательность в межличностных контактах, особенно — близких, интимных. Диссонанс между идеалом и реальностью приносит разочарование.",
    c42: "Упорство в достижении целей, рационализация, гибкость позиции несмотря на неудачи и трудности, субъективно переживаемые как избыточные.",
    c43: "Потребность в покое и ободрении для избавления от субъективно переживаемой неудовлетворенности; это связано с опасениями новых трудностей, мешающих реализации собственных намерений и расширению сферы деятельности.",
    c45: "Убежденность в реалистичности своих надежд, потребность в ободрении и поддержке. Обидчивость и сосредоточенность на своих проблемах.",
    c46: "Выраженная избирательность в межличностных отношениях, особенно в сфере близких, интимных отношений. Ирреальность притязаний.",
    c47: "Убежденность и упрямство в отстаивании своих намерений несмотря на противодействие внешних обстоятельств. Нетерпимость к слабостям других в межличностных контактах узкого круга.",
    c50: "Стремление не обнаружить свою сентиментальность и обидчивость, эгоцентрическая сосредоточенность на своих проблемах.",
    c51: "Ощущение изолированности и одиночества. Потребность в ярких эмоциональных переживаниях, эгоцентрическая сосредоточенность на своих проблемах, обидчивость.",
    c52: "Сдержанность, за которой скрывается обида и неудовлетворенность. Защитный механизм рационализации уменьшает напряженность.",
    c53: "Эгоцентрическая обидчивость, ощущение изолированности и непонятости окружающими, отсутствия поддержки",
    c54: "Эгоцентрическая обидчивость; убежденность в том, что надежды и замыслы осуществимы, требующая поддержки и ободрения.",
    c56: "Эгоцентрическая обидчивость, эмоциональная сдержанность. Физиологические потребности в зоне комфорта.",
    c57: "Чувства подменяются рассуждательством.",
    c60: "Стремление к бесконфликтному общению и физиологическому комфорту.",
    c61: "Затруднения в межличностных контактах узкого круга, физиологические потребности в зоне комфорта.",
    c62: "Защитный механизм рационализации задействован в связи с неудовлетворенностью своей социальной позицией. Физиологические потребности в зоне комфорта.",
    c63: "Блокирована потребность в самореализации и достижении цели, стремление оградить себя от дополнительных волнений. Физиологические потребности в зоне комфорта, но не окрашены позитивными переживаниями.",
    c64: "Выраженная разборчивость и избирательность в межличностных контактах. Нереальные требования к объекту влечения.",
    c65: "Эгоцентрическая обидчивость. Эмоциональная сдержанность. Физиологическая сфера не блокирована.",
    c67: "Вынужденная уступчивость. Физиологические потребности в зоне относительного комфорта.",
    c70: "Для сохранения социальных связей и теплых отношений проявляется уступчивость.",
    c71: "Эмоциональная заторможенность. Сдержанность в притязаниях и надеждах, вынужденный отказ от реализации некоторых потребностей.",
    c72: "В связи с обстоятельствами, ограничивающими свободу действий, вынужденный отказ от реализации намерений и упорства в отстаивании своей позиции.",
    c73: "В связи с обстоятельствами, ограничивающими свободу действий, вынужденный отказ от самореализации.",
    c74: "Убежденность в реальности своих планов и упорство в их достижении, несмотря на давление обстоятельств, вынуждающих идти на компромиссные решения. Избыточная критичность в оценке лиц ближайшего окружения.",
    c75: "Сложность ситуации искажает непосредственность чувств, подменяя их интеллектуальной переработкой, тенденцией к раздумьям.",
    c76: "Вынужденная установка на компромиссное поведение и временный отказ от реализации некоторых намерений. Физиологические потребности не блокированы.",
    d01: "Отказ от расслабления и уступок, стремление сохранить активность, овладеть эмоциями. Нет возможности реализовать потребность в любви, понимании, дружелюбных отношениях, беспокойная неудовлетворенность, связанная с осознанием своей зависимости от объекта привязанности. Раздражительность и трудности концентрации внимания.",
    d02: "Нет возможности для реализации потребности в отстаивании своей позиции и права на уважение. Противодействие средовому давлению вызвало перенапряжение.",
    d03: "Болезненно переживается отсутствие возможности реализовать потребность в самореализации и достижении желаемых целей, что является почвой для гневных вспышек, невротизации, психосоматических расстройств (кардиалгии). Ощущение бессилия перед существующими препятствиями. Чувство страха, нервное истощение, беспокойная раздражительность.",
    d04: "Состояние стресса в связи с блокировкой непосредственного поведения, невозможностью реализовать потребность в радостном общении, беззаботном существовании. Неуверенность, тревожная настороженность. Болезненно переживается неудовлетворенное тщеславие, потребность нравиться окружающим. Отказ от компромиссов, упорство в ирреальных притязаниях.",
    d05: "Стресс, контролируемый тонкостью суждений и контролем рассудка над эмоциями. Тенденция к излишней доверчивости в качестве защитного механизма вызывает повышенную требовательность к искренности окружающих, особенно в контактах узкого круга. Контролируемая сензитивность.",
    d06: "Подавление физиологических потребностей. Неудовлетворенная потребность в отношениях, полных взаимопонимания, с тенденцией сохранить свое превосходство.",
    d07: "Повышенная чувствительность к внешним раздражителям. Потребность в преодолении ограничений, в том числе дистанции, отделяющей от окружающих; стремление к самостоятельности в принятии решений.",
    d10: "Нетерпеливость, беспокойство, угнетенность. Блокирована потребность в теплых отношениях и любви; стремление избежать отношений, обязывающих к ответственности. Неустойчивость состояния, беспокойные попытки изменить ситуацию, что может отразиться на концентрации внимания, работоспособности.",
    d12: "Стресс, ослабляющий волю и настойчивость. Стремление избавиться от ситуации, оказывающей чрезмерное давление. Перенапряжение от усилий, направленных на преодоление существующих трудностей, воспринимается как избыточное и бесполезное. Разлад в сфере значимых межличностных контактов.",
    d13: "Чувство несчастливости, вызванное разладом в сфере значимых межличностных контактов. Гневные реакции. Блокированность сексуальной потребности или иной значимой сферы самореализации. Возможность кардиалгии. Беспомощность с- проявлениями раздражительности. Нарушен баланс между тенденцией к активности и контролем.",
    d14: "Состояние стресса, переживание разочарованности. Противоречивое сочетание разнонаправленных тенденций — стремление уйти от обременительных отношений и страх потерять объект привязанности.",
    d15: "Болезненно переживается отсутствие возможности реализовать потребность в любви и теплых отношениях; стремление избавиться от гнетущего состояния, нетерпеливость; потребность в понимании и доброжелательных отношениях неудовлетворена. Напряженность вызывает чувство раздражения, ощущение непонятости значимыми окружающими.",
    d16: "Стресс, выраженная неудовлетворенность, которая вызвана чуством приниженности и проявляется ограничительным поведением. Зависимость позиции, неуверенность, повышенная чувствительность к средовым воздействиям. Выраженный контроль рассматривается как единственная гарантия самоутверждения и отстаивания своих позиций. Основные проблемы — недостаток признания и повышенный самоконтроль.",
    d17: "Стресс. Блокирована потребность в независимости. Ситуация вызывает неудовлетворенность. Повышенный самоконтроль помогает скрыть свою ранимость. Сложившиеся отношения тягостны, однако потребность в свободе действий сталкивается с опасениями в разрыве контактов, создающих атмосферу доброжелательности и сотрудничества. Беспокойство, нарушающее продуктивную концентрацию внимания.",
    d20: "Блокирована потребность в отстаивании своих позиций. Способность к сопротивлению противодействующим внешним факторам исчерпана, однако установка на достижение целей остается устойчивой. Субъективное отношение к ситуации мешает оценить ее трезво, что создает внутренний конфликт между ригидностью установки и неразрешимостью проблемы.",
    d21: "Блокирована потребность в позитивной самооценке и уважении со стороны референтной группы. Противодействие среды воспринимается как враждебное. Ощущение утраты воли и жизнестойкости, потребность в избавлении от данной ситуации. Стресс и разлад межличностных отношений.",
    d23: "Состояние гневливой раздражительности в связи с субъективным ощущением враждебности окружающих, высокий уровень невротизации, возможны кардиалгии. Давление внешних обстоятельств воспринимается как невыносимое, требования — как неразумные. Ощущение собственного бессилия перед лицом несправедливости.",
    d24: "Стресс, вызванный конфликтом между надеждой и необходимостью (желаниями и реальностью), в связи с состоянием выраженного разочарования. Тревожная неуверенность усиливает стремление уйти от ответственных решений, переключиться на малозначимые, но отвлекающие от проблем занятия. Нерешительность, вызванная разочарованием.",
    d25: "Нет возможности реализовать потребность в уважении и понимании. Субъективное переживание униженности, отсутствия доверия и расположения к себе; в связи с этим страдает самоуважение. Без поддержки и признания трудно принять необходимое решение и избавиться от унижающей достоинство ситуации.",
    d26: "Эмоциональная напряженность связана с перенапряжением избыточного самоконтроля, используемого как инструмент для завоевания расположения и уважения других. Несмотря на недостаток признания ригидно сохраняется установка на исключительность своей позиции. Желание избавиться от неприятной ситуации не может служить поводом для компромиссных решений. Упорство в притязаниях вопреки печальной реальности.",
    d27: "Блокирована потребность в независимости. Стремление избавиться от ограничений. В противодействии сильному давлению внешних обстоятельств не достает целенаправленности.",
    d30: "Проблема сдерживания противодействия обстоятельствам, вызванного блокировкой потребности к самореализации и достижению целей. Стремление к сдерживанию гипертимных реакций. Нетерпеливость и раздражительность. Эмоциональное напряжение может проявиться психосоматическим вариантом дезадаптации (гипертония, кардиалгия). Страх потерь, субъективизм в оценке ситуации. Бессилие перед лицом препятствий, стоящих на пути к реализации собственных намерений.",
    d31: "Подавленное противодействие обстоятельствам, препятствующим свободной самореализации личности и достижению целей. Неспособность к релаксации. Нетерпеливость, раздражительность. Противоречие между разнонаправленными тенденциями (высокой спонтанностью и повышенным самоконтролем) приводит к избыточной эмоциональной напряженности. Физиологический вариант дезадаптации (гипертония, кардиалгия). Нарушена гармония в сфере значимых межличностных отношений. Чувство несчастливости, чувство бессилия что-либо исправить, наладить.",
    d32: "Выраженный стресс в связи с блокированностью самореализации. Нет возможности реализовать потребность достижения успеха, утрачена лидирующая позиция в сложившейся ситуации. Проблема уязвленного самолюбия, неудовлетворенность своим социальным статусом.",
    d34: "Стресс, проявляющийся выраженной эмоциональной неустойчивостью и тревогой, связан с разочарованием. Защитный механизм — вытеснение истинных причин конфликта. Стремление сохранить хорошее впечатление о себе в кругу значимых межличностных контактов. Высокие притязания сталкиваются с невозможностью реализации своих намерений и надежд. Чувство обманутого доверия, ощущение своего положения как жертвы злой воли окружающих людей. Своя доля вины в конфликте перекладывается на других.",
    d35: "Болезненно переживается отсутствие возможности реализовать потребность в сохранении собственной индивидуальности и «социальной ниши», создающей ощущение понимания и безопасности. Состояние крайней разочарованности, неудовлетворенности. Потребность в сочувствии и ощущение собственного бессилия.",
    d36: "Напряженность, связанная с блокированностью физиологических потребностей, чрезмерно ограничиваемых. Сложившаяся ситуация ущемляет чувство независимости. Выраженный самоконтроль в сфере чувственности приводит к изоляции. Стремление к завоеванию признания и уважения со стороны значимых других. Неуверенность усугубляется недостатком внимания к своей персоне.",
    d37: "Стресс, вызванный разочарованиями и препятствиями на пути к реализации своих намерений. Противодействие обстоятельствам, препятствующим свободной самореализации личности и раздражение сочетаются с неуверенностью. Потребность в избавлении от ограничений и в обретении свободы принятия решений. Фрустрирована потребность в независимости.",
    d40: "Беспокойная напряженность. Неудовлетворена потребность в непосредственной самореализации в активном взаимодействии с окружающими и без обременяющей ответственности. Вытеснение истинных причин неудовлетворенности. Убежденность в том, что надежды и желания должны быть реализованы сами собой, без применения собственных усилий. Потребность в признании и помощи со стороны окружающих, чувство страха и неуверенности.",
    d41: "Тревожное беспокойство, базирующееся на внутренне конфликтном сочетании разнонаправленных тенденций: стремления к непосредственной самореализации без обременяющей ответственности сталкивается с тенденцией к повышенному самоконтролю. Колебания настроения, проблема уязвленного самолюбия, неудовлетворенность тщеславия. Переживание нарушенных конгруэнтных отношений со значимыми окружающими. Стремление к подавлению неустойчивости эмоциональных проявлений. Дистресс. Выраженная подверженность средовым воздействиям, зависимость от реакции значимых других.",
    d42: "Состояние стресса, вызванное неудовлетворенностью потребности в спонтанной самореализации без обременительной ответственности, противоречиво сочетающейся с ригидностью рациональных установок на удержание собственных позиций. Конфликт между беспечной уверенностью в саморешаемости проблем и трезвой оценкой реально существующей ситуации. Тревожная неуверенность, пессимистический фон настроения, трудности в принятии решений, бездеятельность.",
    d43: "Блокирована потребность в самореализации, дистресс, тревожность и беспокойство. Высокий уровень притязаний и потребность в признании сталкиваются с противодействием, вызывающим неуверенность в возможности успеха. Вытеснение истинных причин конфликта, стремление переложить ответственность за сложившуюся ситуацию на других. Склонность видеть себя в роли жертвы собственной доверчивости.",
    d45: "Неудовлетворенная потребность в спонтанной самореализации без обременительной ответственности и в сохранении собственной индивидуальности. Состояние характеризуется уходом от межличностных контактов в мир собственных переживаний. Сдержанность в проявлении чувств, недоверчивость; ирреальность притязаний маскируется замкнутостью. Настороженность, сензитивность. Подавлены творческие наклонности; экзальтация чувств под контролем.",
    d46: "Неудовлетворенная потребность в признании, беспокойство, тревога, комплекс собственного несовершенства маскируется демонстративностью поведения. Высокий уровень притязаний сталкивается с ощущением собственной изолированности. Жажда одобрения и успеха неудовлетворена. Состояние характеризуется переживанием чувства одиночества и неуверенности, маскируемых напускным безразличием, презрительным отношением к критике в свой адрес.",
    d47: "Стресс, связанный с блокировкой потребности в независимости и спонтанной самореализации. Напряженность, настороженность, настойчивая потребность в избавлении от каких бы то ни было ограничений. Неуверенность в возможности улучшения ситуации не снижает уровень притязаний и не приводит к компромиссным решениям.",
    d50: "Нетерпеливость и напряженность, высокая мотивация достижения сочетается с чувством недостаточности понимания и сочувствия со стороны окружающих. Настороженная критичность в межличностных отношениях. Повышенные требования к окружающим как защита от собственной излишней доверчивости.",
    d51: "Неудовлетворенность в связи с блокировкой аффилиативной потребности в сфере значимых межличностных контактов. Беспокойная неудовлетворенность, раздражительность и нетерпеливость, вызывающие трудности концентрации внимания.",
    d52: "Блокирована потребность в уважении и понимании. Субъективное переживание униженности, отсутствие доверия и расположения к себе со стороны значимых окружающих. В связи с этим страдает самоуважение. Без поддержки и признания трудно принять необходимое решение и избавиться от унижающей достоинство ситуации.",
    d53: "Нет возможности реализовать потребность в сохранении собственной индивидуальности и той «социальной ниши», которая бы создавала ощущение понимания и безопасности. Возможны явления нервного переутомления, кардиологических функциональных нарушений. Состояние крайней разочарованности, потребность в сочувствии, ощущение собственного бессилия в стремлении к достижению цели.",
    d54: "Блокирована потребность в спонтанной самореализации без обременительной ответственности и в сохранении собственной индивидуальности. Состояние характеризуется уходом от межличностных контактов в мир собственных переживаний. Сдержанность в проявлении чувств, недоверчивость. Ирреальность притязаний маскируется замкнутостью. Настороженность, сензитивность. Подавлены творческие наклонности; экзальтация чувств под контролем.",
    d56: "Напряженность, вызванная трудностями в межличностных контактах, имеющих большую значимость. Высокий уровень притязаний вносит разлад в отношения. Ограничительные тенденции проявляются как мера защиты сензитивной личности, критичной, разборчивой, с независимостью суждений. Избирательность в контактах, интеллектуальная и эстетическая чувствительность.",
    d57: "Напряженность, вызванная ограничением собственной независимости внешними воздействиями. Выраженный субъективизм в оценке явлений окружающей жизни, избирательность в межличностных контактах, категоричность и бескомпромиссность в принятии самостоятельных решений. Потребность в независимости.",
    d60: "Стресс, вызванный подавлением физиологических потребностей. Неудовлетворенное желание найти признание и общность интересов в кругу значимых окружающих вызывает повышенную напряженность самоконтроля. Сдерживаемая чувственность, потребность в уважении и внимательном отношении.",
    d61: "Неудовлетворенность и отсутствие взаимопонимания в сфере значимых межличностных контактов вызывает усиление контроля над чувственностью; подавление физиологических потребностей; неуверенность в себе. Стремление к конгруэнтным отношениям вступает в противоречие с тенденцией к отстаиванию своей индивидуальности.",
    d62: "Стресс вызван неудовлетворенностью потребности в сохранении личностной позиции, в уважении со стороны значимых окружающих. Высокий уровень притязаний находится в конфликтном соотношении с реальными обстоятельствами, ущемляющими самолюбие. Упорство сталкивается с собственной неуверенностью.",
    d63: "Стресс, связанный с подавлением физиологических потребностей. Сложившаяся ситуация ущемляет чувство независимости. Выраженный самоконтроль в сфере чувственности приводит к изоляции. Стремление к завоеванию признания и уважения со стороны значимых других. Неуверенность усугубляется недостатком внимания к своей персоне.",
    d64: "Нет возможности реализовать потребность в признании. Стремление скрыть неуверенность и тревогу демонстративностью поведения. Высокий уровень притязаний сталкивается с ощущением собственной изолированности. Жажда одобрения и успеха неудовлетворена. Состояние характеризуется переживанием чувства одиночества и неуверенности, маскируемых напускным безразличием, презрительным отношением к критике в свой адрес.",
    d65: "Напряженность, вызванная трудностями в межличностных контактах, имеющих большую значимость. Высокий уровень притязаний создает почву для разлада в отношениях. Ограничительные тенденции проявляются как мера защиты сензитивной личности, критичной, разборчивой, с независимостью суждений. Избирательность в контактах, интеллектуальная и эстетическая чувствительность. Защитный механизм сублимации.",
    d67: "Протест в отношении запретов и нежелательных ограничений. Потребность распоряжаться своей судьбой.",
    d70: "Потребность в ярких переживаниях, общении, неистовая увлеченность, уверенность в себе, стремление достичь большего, неуемная активность.",
    d71: "Эмоциональная неустойчивость, связанная с неудовлетворенностью сложившихся отношений. Попытка контролировать свои чувства, чтобы скрыть свою ранимость, усиливает обостренную чувствительность к средовым воздействиям. Установка на компромиссное поведение. Беспокойство, сказывающееся на ослаблении функции внимания.",
    d72: "Нет возможности реализовать потребность в независимости. Стремление избавиться от ограничений. В противодействии сильному давлению обстоятельств не достает целенаправленности.",
    d73: "Стресс, вызванный разочарованиями и препятствиями на пути к реализации своих намерений. Противодействие обстоятельствам, препятствующим свободной самореализации личности и раздражительность сочетаются с неуверенностью. Потребность в избавлении от ограничений и обретении свободы принятия решений. Фрустрирована потребность в независимости.",
    d74: "Стресс, связанный с блокированностью потребности в независимости и спонтанной самореализации. Напряженность, настойчивая потребность в избавлении от каких бы то ни было ограничений. Неуверенность в возможности улучшения ситуации не снижает уровень притязаний и не приводит к компромиссным решениям.",
    d75: "Стресс, вызванный ограничением собственной независимости внешними преградами. Чувствительность, впечатлительность, взыскательность в межличностных отношениях. Недоверчивость. Обособленность и требовательность к другим.",
    d76: "Стресс, вызванный ограничениями или запретами. Потребность распоряжаться своей судьбой. Протест против однообразия и заурядности. Настойчивость в отстаивании своего мнения, авторитарность. Повышенное чувство независимости.",
  };

  let lusherAns = "";
  let lusher1 = "";
  let lusher2 = "";
  let lusher3 = "";
  let lusher4 = "";
  if (test4ArrFinal.length == 8) {
    lusher1 = test4ArrFinal[0].toString() + test4ArrFinal[1].toString();
    lusher2 = test4ArrFinal[2].toString() + test4ArrFinal[3].toString();
    lusher3 = test4ArrFinal[4].toString() + test4ArrFinal[5].toString();
    lusher4 = test4ArrFinal[6].toString() + test4ArrFinal[7].toString();
  }
  lusher1 = "a" + lusher1.toString();
  lusher2 = "b" + lusher2.toString();
  lusher3 = "c" + lusher3.toString();
  lusher4 = "d" + lusher4.toString();
  lusher1 = lusher1.toString();
  lusher2 = lusher2.toString();
  lusher3 = lusher3.toString();
  lusher4 = lusher4.toString();
  lusherAns =
    lusher[lusher1] + lusher[lusher2] + lusher[lusher3] + lusher[lusher4];

  const progressWidth1 = (test1Cnt / 21) * 100;
  const progressWidth2 = (test2Cnt / 13) * 100;
  const progressWidth3 = (test3Cnt / 21) * 100;
  const progressWidth4 = ((test4Cnt + 1) / 31) * 100;

  const form1 = useRef();

  const sendEmailTest1 = (e) => {
    e.preventDefault();

    emailjs
      .sendForm(
        "service_bdqeqn8",
        "template_r9jfjj4",
        form1.current,
        "HrfesFaruAkDljEox"
      )
      .then(
        (result) => {
          console.log(result.text);
          setTimeout(window.location.reload(), 1000);
        },
        (error) => {
          console.log(error.text);
        }
      );
  };

  return (
    <div className="App">
      {testID === "Form1" ? (
        <div className="Form1 Form">
          <img
            src={close}
            alt="close"
            className="close"
            onClick={() => {
              setTestID(0);
              setTest1Arr([
                0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
              ]);
              setTest1Cnt(0);
            }}
          />
          <h3>
            Результаты интерпретируются специалистом. Для получения итогов
            укажите ваше имя и электронную почту.
          </h3>
          <div className="line"></div>
          <form ref={form1} onSubmit={sendEmailTest1}>
              <input
                type="text"
                name="test_call_text"
                style={{ display: "none" }}
                value={
                  "Чтобы Вы не откладывали решение в долгий ящик, дарим вам персональный промокод"
                }
              />
            <input type="text" placeholder="Как вас зовут?" name="user_name" />
            <input type="email" placeholder="Ваша почта" name="user_email" />
            <input type="submit" value="Отправить данные" />
            {sumOfTest1 < 14 ? (
              <input
                name="test1_result_number"
                type="text"
                value="0-13"
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
            {sumOfTest1 < 20 && sumOfTest1 > 13 ? (
              <input
                name="test1_result_number"
                type="text"
                value="14-19"
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
            {sumOfTest1 < 29 && sumOfTest1 > 19 ? (
              <input
                name="test1_result_number"
                type="text"
                value="20-28"
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
            {sumOfTest1 < 64 && sumOfTest1 > 28 ? (
              <input
                name="test1_result_number"
                type="text"
                value="29-63"
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
            {sumOfTest1 < 14 ? (
              <input
                name="test1_result_title"
                type="text"
                value="Нормальное состояние"
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
            {sumOfTest1 < 20 && sumOfTest1 > 13 ? (
              <input
                name="test1_result_title"
                type="text"
                value="Легкое депрессивное расстройство"
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
            {sumOfTest1 < 29 && sumOfTest1 > 19 ? (
              <input
                name="test1_result_title"
                type="text"
                value="Депрессивное расстройство средней степени тяжести "
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
            {sumOfTest1 < 64 && sumOfTest1 > 28 ? (
              <input
                name="test1_result_title"
                type="text"
                value="Депрессивное расстройство тяжелой степени тяжести "
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
            {sumOfTest1 < 14 ? (
              <input
                name="test1_result_text"
                type="text"
                value="Значение 0-13 баллов включительно свидетельствует о нормальном психоэмоциональном состоянии. Однако обратите внимание, что Вы получили результат тестирования, а не диагноз. Для более объективной картины и подробной консультации необходима сессия со специалистом.

Если время от времени у Вас появляются тревожные мысли, рекомендуем провести психотерапевтическую сессию.
"
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
            {sumOfTest1 < 20 && sumOfTest1 > 13 ? (
              <input
                name="test1_result_text"
                type="text"
                value="Значение 14-19 баллов включительно свидетельствует о легком депрессивном расстройстве. Вы можете быть равнодушны к тому, что раньше приносило радость и удовольствие, устаете даже от нетрудной и недлительной работы. Вам трудно сосредоточиться, настроение подавленное, могут иметь место вспышки раздражения и агрессии. Вы ловите себя на мысли, что вам жалко себя.

Важно: вы получили результат тестирования, а не диагноз. Для более объективной картины и подробной консультации необходима сессия со специалистом.

Хотите чувствовать больше радости от жизни, находить удовольствие в каждом дне и опираться на ваши внутренние ресурсы? Рекомендуем провести психотерапевтическую сессию.
"
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
            {sumOfTest1 < 29 && sumOfTest1 > 19 ? (
              <input
                name="test1_result_text"
                type="text"
                value="Значение 20-28 баллов включительно свидетельствует о депрессивном расстройстве средней степени. Вы подавлены, чувствуете душевную тоску. Вас могут посещать мысли о собственной бесполезности, самооценка явно понижена. У вас проблемы с качеством сна – бессонница ночью, сонливость днем. Ваша физическая активность заметно снизилась, потому что вам трудно заставить себя что-либо сделать.

Важно: вы получили результат тестирования, а не диагноз. Для более объективной картины и подробной консультации необходима сессия со специалистом.

Хотите снова получать радость от кажд ого прожитого дня и понимать, ради чего просыпаетесь утром? Рекомендуем провести психотерапевтическую сессию.
"
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
            {sumOfTest1 < 64 && sumOfTest1 > 28 ? (
              <input
                name="test1_result_text"
                type="text"
                value="Значение 29-63 балла включительно свидетельствует о депрессивном расстройстве тяжелой степени. Вы глубоко подавлены, не способны испытывать радость и удовольствие. Вам крайне тяжело концентрировать внимание и сохранять трудоспособность, проявлять любую активность. Наблюдается потеря аппетита и интереса к окружающему миру. Вы регулярно испытываете чувство вины, печали, безнадежности и беспомощности.

Важно: вы получили результат тестирования, а не диагноз. Для более объективной картины и подробной консультации необходима сессия со специалистом.

Хотите снова замечать вокруг радостное и положительное, вернуть вкус к жизни, обрести внутренние опоры и смыслы? Рекомендуем провести психотерапевтическую сессию.
"
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
          </form>
          <button
            className="form1Prevbtn"
            onClick={() => {
              setTestID(1);
              setTest1Cnt(test1Cnt - 1);
            }}
          >
            <img src={arrow} alt="icon" />
            <h6>Назад</h6>
          </button>
        </div>
      ) : (
        <> </>
      )}
      {testID === "Form2" ? (
        <div className="Form2 Form">
          <img
            src={close}
            alt="close"
            className="close"
            onClick={() => {
              setTestID(0);
              setTest2Arr([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]);
              setTest2Cnt(0);
            }}
          />
          <h3>
            Результаты интерпретируются специалистом. Для получения итогов
            укажите ваше имя и электронную почту.
          </h3>
          <div className="line"></div>
          <form ref={form1} onSubmit={sendEmailTest1}>
              <input
                type="text"
                name="test_call_text"
                style={{ display: "none" }}
                value={
                  "Чтобы Вы не откладывали решение в долгий ящик, дарим вам персональный промокод"
                }
              />
            <input type="text" placeholder="Как вас зовут?" name="user_name" />
            <input type="email" placeholder="Ваша почта" name="user_email" />
            <input type="submit" value="Отправить данные" />
            {sumOfTest2 < 10 ? (
              <input
                name="test1_result_number"
                type="text"
                value="0-9"
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
            {sumOfTest2 < 20 && sumOfTest2 > 9 ? (
              <input
                name="test1_result_number"
                type="text"
                value="10-19"
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
            {sumOfTest2 < 23 && sumOfTest2 > 19 ? (
              <input
                name="test1_result_number"
                type="text"
                value="19-22"
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
            {sumOfTest2 > 22 ? (
              <input
                name="test1_result_number"
                type="text"
                value="23+"
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
            {sumOfTest2 < 10 ? (
              <input
                name="test1_result_title"
                type="text"
                value="Удовлетворительное эмоциональное состояние"
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
            {sumOfTest2 < 20 && sumOfTest2 > 9 ? (
              <input
                name="test1_result_title"
                type="text"
                value="Легкая депрессия"
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
            {sumOfTest2 < 23 && sumOfTest2 > 19 ? (
              <input
                name="test1_result_title"
                type="text"
                value="Умеренная депрессия"
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
            {sumOfTest2 > 22 ? (
              <input
                name="test1_result_title"
                type="text"
                value="Тяжелая депрессия"
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
            {sumOfTest2 < 10 ? (
              <input
                name="test1_result_text"
                type="text"
                value="Значение до 9 баллов включительно свидетельствует о том, что ваше эмоциональное состояние удовлетворительное. Однако обратите внимание, что вы получили результат стандартизированного тестирования, а не диагноз. Для более объективной картины и подробной консультации необходима сессия со специалистом.

Хотите чувствовать больше радости от жизни, находить удовольствие в каждом дне и опираться на ваши внутренние ресурсы? Рекомендуем провести психотерапевтическую сессию.

"
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
            {sumOfTest2 < 20 && sumOfTest2 > 9 ? (
              <input
                name="test1_result_text"
                type="text"
                value="Значение 10-19 баллов включительно свидетельствует о легком депрессивном расстройстве. Вы можете быть равнодушны к тому, что раньше приносило радость и удовольствие, устаете даже от нетрудной и недлительной работы. Вам трудно сосредоточиться, настроение подавленное, могут иметь место вспышки раздражения и агрессии. Вы ловите себя на мысли, что вам жалко себя.

Важно: вы получили результат тестирования, а не диагноз. Для более объективной картины и подробной консультации необходима сессия со специалистом.

Хотите чувствовать больше радости от жизни, находить удовольствие в каждом дне и опираться на ваши внутренние ресурсы? Рекомендуем провести психотерапевтическую сессию.

"
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
            {sumOfTest2 < 23 && sumOfTest2 > 19 ? (
              <input
                name="test1_result_text"
                type="text"
                value="Значение 19-22 балла включительно свидетельствует о депрессивном расстройстве средней степени. Вы подавлены, чувствуете душевную тоску. Вас могут посещать мысли о собственной бесполезности, самооценка явно понижена. У вас проблемы с качеством сна – бессонница ночью, сонливость днем. Ваша физическая активность заметно снизилась, потому что вам трудно заставить себя что-либо сделать.

Важно: вы получили результат тестирования, а не диагноз. Для более объективной картины и подробной консультации необходима сессия со специалистом.

Хотите снова получать радость от каждого прожитого дня и понимать, ради чего просыпаетесь утром? Рекомендуем провести психотерапевтическую сессию.

"
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
            {sumOfTest2 > 22 ? (
              <input
                name="test1_result_text"
                type="text"
                value="Значение более 23 баллов свидетельствует о депрессивном расстройстве тяжелой степени. Вы глубоко подавлены, не способны испытывать радость и удовольствие. Вам крайне тяжело концентрировать внимание и сохранять трудоспособность, проявлять любую активность. Наблюдается потеря аппетита и интереса к окружающему миру. Вы регулярно испытываете чувство вины, печали, безнадежности и беспомощности.

Важно: вы получили результат тестирования, а не диагноз. Для более объективной картины и подробной консультации необходима сессия со специалистом.

Хотите снова замечать вокруг радостное и положительное, вернуть вкус к жизни, обрести внутренние опоры и смыслы? Рекомендуем провести психотерапевтическую сессию.

"
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
          </form>
          <button
            className="form1Prevbtn"
            onClick={() => {
              setTestID(2);
              setTest2Cnt(test2Cnt - 1);
            }}
          >
            <img src={arrow} alt="icon" />
            <h6>Назад</h6>
          </button>
        </div>
      ) : (
        <> </>
      )}
      {testID === "Form3" ? (
        <div className="Form3 Form">
          <img
            src={close}
            alt="close"
            className="close"
            onClick={() => {
              setTestID(0);
              setTest3Arr([
                0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
              ]);
              setTest3Cnt(0);
            }}
          />
          <h3>
            Результаты интерпретируются специалистом. Для получения итогов
            укажите ваше имя и электронную почту.
          </h3>
          <div className="line"></div>
          <form ref={form1} onSubmit={sendEmailTest1}>
              <input
                type="text"
                name="test_call_text"
                style={{ display: "none" }}
                value={
                  "Чтобы Вы не откладывали решение в долгий ящик, дарим вам персональный промокод"
                }
              />
            <input type="text" placeholder="Как вас зовут?" name="user_name" />
            <input type="email" placeholder="Ваша почта" name="user_email" />
            <input type="submit" value="Отправить данные" />
            {sumOfTest3 < 22 ? (
              <input
                name="test1_result_number"
                type="text"
                value="0-21"
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
            {sumOfTest3 < 36 && sumOfTest3 > 21 ? (
              <input
                name="test1_result_number"
                type="text"
                value="22-35"
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
            {sumOfTest3 > 35 ? (
              <input
                name="test1_result_number"
                type="text"
                value="36+"
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
            {sumOfTest3 < 22 ? (
              <input
                name="test1_result_title"
                type="text"
                value="Незначительный уровень тревоги"
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
            {sumOfTest3 < 36 && sumOfTest3 > 21 ? (
              <input
                name="test1_result_title"
                type="text"
                value="Средняя выраженность тревоги"
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
            {sumOfTest3 > 35 ? (
              <input
                name="test1_result_title"
                type="text"
                value="Очень высокая тревога"
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
            {sumOfTest3 < 22 ? (
              <input
                name="test1_result_text"
                type="text"
                value="Значение до 21 балла включительно свидетельствует о незначительном уровне тревоги в вашей жизни. Время от времени вы можете испытывать пониженное настроение, вялость, спад интереса к жизни, повышенную утомляемость. В такие моменты вы бываете раздражительны, испытываете эмоциональный дискомфорт, однако, как правило, способны скрыть эти симптомы от окружающих.

Важно: вы получили результат тестирования, а не диагноз. Для более объективной картины и подробной консультации необходима сессия со специалистом.

Хотите чувствовать себя еще увереннее, счастливее, гармоничнее и иметь на это внутренние ресурсы? Рекомендуем провести психотерапевтическую сессию.


"
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
            {sumOfTest3 < 36 && sumOfTest3 > 21 ? (
              <input
                name="test1_result_text"
                type="text"
                value="Значение от 22 до 35 баллов означает среднюю выраженность тревоги. Вы часто чувствуете повышенную утомляемость, отсутствие желания с кем-то общаться, резкие перепады настроения и устойчивую апатию. Вам трудно концентрировать внимание, принимать решения. Есть проблемы с качеством сна. Вам не всегда удается скрыть эмоциональный дискомфорт от окружающих, и они понимают, что вы часто бываете раздражены.

Важно: вы получили результат тестирования, а не диагноз. Для более объективной картины и подробной консультации необходима сессия со специалистом.

Хотите научиться слышать Ваши истинные потребности, преодолеть сложности во взаимоотношениях и ярче чувствовать вкус жизни? Рекомендуем провести психотерапевтическую сессию.


"
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
            {sumOfTest3 > 35 ? (
              <input
                name="test1_result_text"
                type="text"
                value="Значение от 36 до 63 баллов свидетельствует об очень высокой тревоге. Вас часто мучает чувство страха, причем даже без конкретного объекта или ситуации. Есть неприятные дискомфортные ощущения в теле: эпизоды нехватки воздуха, повышенной потливости, невозможности вздохнуть полной грудью, учащенного сердцебиения и т.д. Вам с трудом дается участие в социальной жизни. Ночной сон не приносит отдыха и перезагрузки, утром вы чувствуете разбитость. Окружающие замечают ваши сильные перепады настроения, нервозность.

Важно: вы получили результат тестирования, а не диагноз. Для более объективной картины и подробной консультации необходима сессия со специалистом.

Хотите найти силы изменить жизнь в лучшую сторону, обрести веру в себя, опереться на важные смыслы, освободиться от внутренних страхов и тревог? Рекомендуем провести психотерапевтическую сессию.



"
                style={{ display: "none!important" }}
              />
            ) : (
              <></>
            )}
          </form>
          <button
            className="form1Prevbtn"
            onClick={() => {
              setTestID(3);
              setTest3Cnt(test3Cnt - 1);
            }}
          >
            <img src={arrow} alt="icon" />
            <h6>Назад</h6>
          </button>
        </div>
      ) : (
        <> </>
      )}
      {testID === 0 ? (
        <>
          <header>
            <div className="leftLinks">
              <a href="https://alferovich.com/#aboutme">Обо мне</a>
              <a href="https://alferovich.com/#services">Мои услуги</a>
              <a href="https://alferovich.com/#principles">Принципы работы</a>
            </div>
            <a href="https://alferovich.com/">
              <img src={logo} />
            </a>
            <div className="rightLinks">
              <a href="https://alferovich.com/#stages">Как проходит сессия</a>
              <a href="https://alferovich.com/#faq">Ответы на вопросы</a>
              <a href="https://alferovich.com/#contacts">Контакты</a>
            </div>
            <img src={burger} className="burgerMenuIcon" onClick={handleShow} />
          </header>
          <Offcanvas show={show} onHide={handleClose} className="mobileMenu">
            <Offcanvas.Header closeButton>
              <Offcanvas.Title className="mobileMenuTitle">
                Меню
              </Offcanvas.Title>
            </Offcanvas.Header>
            <Offcanvas.Body className="mobileMenuBody">
              <a href="https://alferovich.com/#aboutme">Обо мне</a>
              <a href="https://alferovich.com/#services">Мои услуги</a>
              <a href="https://alferovich.com/#principles">Принципы работы</a>
              <a href="https://alferovich.com/#stages">Как проходит сессия</a>
              <a href="https://alferovich.com/#faq">Ответы на вопросы</a>
              <a href="https://alferovich.com/#contacts">Контакты</a>
              <a href="https://alferovich.com/">
                <img src={logo} />
              </a>
            </Offcanvas.Body>
          </Offcanvas>
          <div className="startblock">
            <h3>
              Татьяна Александровна Альферович. <br />
              Психоаналитически ориентированный психотерапевт
            </h3>
            <h2>
              <span id="letter1">Узн</span>
              <span id="letter2">айте </span>
              <span id="letter3">се</span>
              <span id="letter4">бя </span>
              <span id="letter5">с пом</span>
              <span id="letter6">ощь</span>
              <span id="letter7">ю проф</span>
              <span id="letter8">ессио</span>
              <span id="letter1">нальных </span>
              <span id="letter9">псих</span>
              <span id="letter10">оло</span>
              <span id="letter11">гических</span>
              <span> </span>
              <span id="letter12">те</span>
              <span id="letter13">с</span>
              <span id="letter14">т</span>
              <span id="letter15">о</span>
              <span id="letter16">в</span>
            </h2>
            <img src={logoWhite} />
          </div>
          <div className="testTitle">
            <h2>
              Оцените <span>ваше состояние</span>, уровень стресса, тревоги и
              внутренних конфликтов.
            </h2>
          </div>
          <div className="testsBlock">
            <div className="row">
              <img src={testImg1} />
              <h3>Шкала депрессии Бека</h3>
              <div className="col">
                <h4>
                  Даёт возможность определить, есть ли у вас депрессия и
                  насколько она сильно выражена.
                </h4>
                <h4>Прохождение теста займёт не более 7 минут.</h4>
                <button onClick={() => setTestID(1)}>Пройти тест</button>
              </div>
            </div>
            <div className="row">
              <img src={testImg2} />
              <h3>
                Шкала депрессии Бека
                <br />
                (версия для подростков)
              </h3>
              <div className="col">
                <h4>
                  Даёт возможность определить, есть ли у подростка депрессия и
                  насколько она сильно выражена.
                </h4>
                <h4>Прохождение теста займёт не более 7 минут.</h4>
                <button onClick={() => setTestID(2)}>Пройти тест</button>
              </div>
            </div>
            <div className="row">
              <img src={testImg3} />
              <h3>Шкала тревоги Бека</h3>
              <div className="col">
                <h4>
                  Даёт возможность определить, есть ли у вас тревожность и
                  оценить её уровень.
                </h4>
                <h4>Прохождение теста займёт не более 5 минут.</h4>
                <button onClick={() => setTestID(3)}>Пройти тест</button>
              </div>
            </div>
            <div className="row">
              <img src={testImg4} />
              <h3>Тест Люшера</h3>
              <div className="col">
                <h4>
                Определяет наличие тревожности и шкалу тревоги.
                </h4>
                <h4>Прохождение теста займёт не более 5 минут. </h4>
                <button onClick={() => setTestID(4)}>Пройти тест</button>
              </div>
            </div>
            <div className="row">
              <img src={testImg5} />
              <h3>MIS: скрининг нарушений памяти</h3>
              <div className="col">
                <h4>
                Позволяет выявить когнитивные нарушения.
                </h4>
                <h4>Прохождение теста займёт не более 5 минут.</h4>
                <button onClick={() => setTestID(5)}>Пройти тест</button>
              </div>
            </div>
            <div className="row">
              <img src={testImg6} />
              <h3>Надежный тест для выявления деменции</h3>
              <div className="col">
                <h4>
                Позволяет выявить степень деменции.
                </h4>
                <h4>Прохождение теста займёт не более 4 минут.</h4>
                <button onClick={() => setTestID(6)}>Пройти тест</button>
              </div>
            </div>
            <div className="row">
              <img src={testImg7} />
              <h3>Аризонский опросник для родственников</h3>
              <div className="col">
                <h4>
                Позволит понять, являются ли появившиеся изменения в поведении близкого человека проявлениями серьезной болезни и помогает выявить когнитивные нарушения на ранней стадии в 90% случаев.
                </h4>
                <h4>Прохождение теста займёт не более 3 минут.</h4>
                <button onClick={() => setTestID(7)}>Пройти тест</button>
              </div>
            </div>
            <div className="row">
              <img src={testImg8} />
              <h3>Шкала UPDRS-5 (оценка паркинсонизма)</h3>
              <div className="col">
                <h4>
                Позволяет выявить диагноз  "деменция с тельцами Леви".
                </h4>
                <h4>Прохождение теста займёт не более 10 минут.</h4>
                <button onClick={() => setTestID(8)}>Пройти тест</button>
              </div>
            </div>
            <div className="row">
              <img src={testImg9} />
              <h3>Субъективная шкала оценки астении (MFI–20)</h3>
              <div className="col">
                <h4>
                Позволяет оценить внутреннее самочувствие.
                </h4>
                <h4>Прохождение теста займёт не более 5 минут. </h4>
                <button onClick={() => setTestID(9)}>Пройти тест</button>
              </div>
            </div>
            <div className="row">
              <img src={testImg10} />
              <h3>Краткая шкала оценки психического статуса (MMSE)</h3>
              <div className="col">
                <h4>
                Позволяет выявить первичное нейропсихологическое обследование.
                </h4>
                <h4>Прохождение теста займёт не более 10 минут.</h4>
                <button onClick={() => setTestID(10)}>Пройти тест</button>
              </div>
            </div>
            <div className="row">
              <img src={testImg11} />
              <h3>Скрининговый тест Mini–Cog</h3>
              <div className="col">
                <h4>
                Позволяет проявить  первичные признаки деменции.
                </h4>
                <h4>Прохождение теста займёт не более 5 минут. </h4>
                <button onClick={() => setTestID(11)}>Пройти тест</button>
              </div>
            </div>
            <h3 className="addTextResultsToMail">
              * Результат теста вы получите на указанную электронную почту
            </h3>
          </div>
        </>
      ) : (
        <></>
      )}
      {testID === 1 && test1Cnt < 21 ? <Test1 /> : <></>}
      {testID === 2 && test1Cnt < 13 ? <Test2 /> : <></>}
      {testID === 3 && test1Cnt < 21 ? <Test3 /> : <></>}
      {testID === 4 ? <Test4 /> : <></>}
    </div>
  );
  function Test1() {
    return (
      <div className="Test Test1">
        {test1Cnt > 0 ? (
          <button className="btnPrev" onClick={() => setTest1Cnt(test1Cnt - 1)}>
            <img src={arrow} alt="icon" />
            <h6>Назад</h6>
          </button>
        ) : (
          <></>
        )}
        {test1Cnt < 22 ? (
          <button
            className="btnNext"
            onClick={() => {
              if (test1Cnt == 20 && test1Arr[test1Cnt] != 0) {
                setTestID("Form1");
              } else if (test1Cnt == 20 && test1Arr[test1Cnt] == 0) {
                setNoAns(true);
              }
              if (test1Arr[test1Cnt] != 0) {
                setTest1Cnt(test1Cnt + 1);
              } else {
                setNoAns(true);
              }
            }}
          >
            <h6>Далее</h6>
            <img src={arrow} alt="icon" />
          </button>
        ) : (
          <></>
        )}
        <h4>{test1Cnt + 1}/21</h4>
        {test1Cnt < 22 ? (
          <>
            <div>
              <img className="papersIcon" src={papersIcon} alt="icon" />
              <h3>
                Этот опросник состоит из 21 группы утверждений. Пожалуйста,
                внимательно прочитайте каждую группу утверждений и затем
                выберите одно утверждение в каждой группе, которое наилучшим
                образом описывает то, как вы себя чувствовали в течение
                последних двух недель, в том числе и сегодня.
              </h3>
            </div>
            <h3>
              Если несколько утверждений в группе одинаково хорошо описывают
              ваше состояние, выберите наибольшее число для этой группы.
              Убедитесь, что вы не выбираете больше одного утверждения для любой
              группы, включая пункт 16 (Изменения в шаблоне сна) или пункт 18
              (Изменения в аппетите).
            </h3>
          </>
        ) : (
          <></>
        )}
        <img
          src={close}
          alt="close"
          className="close"
          onClick={() => {
            setTestID(0);
            setTest1Arr([
              0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            ]);
            setTest1Cnt(0);
          }}
        />
        <div
          className="progress"
          style={{ width: test1Cnt > 20 ? "100%" : `${progressWidth1}%` }}
        ></div>
        <h5 className="qTitle">
          {Test1Titles[test1Cnt]} {noAns ? <span>Выберите ответ</span> : <></>}
        </h5>
        {test1Cnt < 22 ? (
          <>
            <div
              className="qAns"
              onClick={() => {
                setNoAns(false);
                updateElementAtIndex1(test1Cnt, 1);
              }}
            >
              <div
                className="qSquare"
                style={{
                  backgroundColor:
                    test1Arr[test1Cnt] === 1 ? "#d88755" : "initial",
                  border: noAns ? "1px solid red" : "1px solid #464646",
                }}
              ></div>
              <h6 className="qText">{Test1Qs[test1Cnt][0]}</h6>
            </div>
            <div
              className="qAns"
              onClick={() => {
                setNoAns(false);
                updateElementAtIndex1(test1Cnt, 2);
              }}
            >
              <div
                className="qSquare"
                style={{
                  backgroundColor:
                    test1Arr[test1Cnt] === 2 ? "#d88755" : "initial",
                  border: noAns ? "1px solid red" : "1px solid #464646",
                }}
              ></div>
              <h6 className="qText">{Test1Qs[test1Cnt][1]}</h6>
            </div>
            <div
              className="qAns"
              onClick={() => {
                setNoAns(false);
                updateElementAtIndex1(test1Cnt, 3);
              }}
            >
              <div
                className="qSquare"
                style={{
                  backgroundColor:
                    test1Arr[test1Cnt] === 3 ? "#d88755" : "initial",
                  border: noAns ? "1px solid red" : "1px solid #464646",
                }}
              ></div>
              <h6 className="qText">{Test1Qs[test1Cnt][2]}</h6>
            </div>
            <div
              className="qAns"
              onClick={() => {
                setNoAns(false);
                updateElementAtIndex1(test1Cnt, 4);
              }}
            >
              <div
                className="qSquare"
                style={{
                  backgroundColor:
                    test1Arr[test1Cnt] === 4 ? "#d88755" : "initial",
                  border: noAns ? "1px solid red" : "1px solid #464646",
                }}
              ></div>
              <h6 className="qText">{Test1Qs[test1Cnt][3]}</h6>
            </div>
            {test1Cnt === 15 || test1Cnt === 17 ? (
              <div
                className="qAns"
                onClick={() => {
                  setNoAns(false);
                  updateElementAtIndex1(test1Cnt, 5);
                }}
              >
                <div
                  className="qSquare"
                  style={{
                    backgroundColor:
                      test1Arr[test1Cnt] === 5 ? "#d88755" : "initial",
                    border: noAns ? "1px solid red" : "1px solid #464646",
                  }}
                ></div>
                <h6 className="qText">{Test1Qs[test1Cnt][4]}</h6>
              </div>
            ) : (
              <></>
            )}
            {test1Cnt === 15 || test1Cnt === 17 ? (
              <div
                className="qAns"
                onClick={() => {
                  setNoAns(false);
                  updateElementAtIndex1(test1Cnt, 6);
                }}
              >
                <div
                  className="qSquare"
                  style={{
                    backgroundColor:
                      test1Arr[test1Cnt] === 6 ? "#d88755" : "initial",
                    border: noAns ? "1px solid red" : "1px solid #464646",
                  }}
                ></div>
                <h6 className="qText">{Test1Qs[test1Cnt][5]}</h6>
              </div>
            ) : (
              <></>
            )}
            {test1Cnt === 15 || test1Cnt === 17 ? (
              <div
                className="qAns"
                onClick={() => {
                  setNoAns(false);
                  updateElementAtIndex1(test1Cnt, 7);
                }}
              >
                <div
                  className="qSquare"
                  style={{
                    backgroundColor:
                      test1Arr[test1Cnt] === 7 ? "#d88755" : "initial",
                    border: noAns ? "1px solid red" : "1px solid #464646",
                  }}
                ></div>
                <h6 className="qText">{Test1Qs[test1Cnt][6]}</h6>
              </div>
            ) : (
              <></>
            )}
          </>
        ) : (
          <h4>ANS</h4>
        )}
      </div>
    );
  }
  function Test2() {
    return (
      <div className="Test Test2">
        {test2Cnt > 0 ? (
          <button className="btnPrev" onClick={() => setTest2Cnt(test2Cnt - 1)}>
            <img src={arrow} alt="icon" />
            <h6>Назад</h6>
          </button>
        ) : (
          <></>
        )}
        {test2Cnt < 14 ? (
          <button
            className="btnNext"
            onClick={() => {
              if (test2Cnt == 12 && test2Arr[test2Cnt] != 0) {
                setTestID("Form2");
              } else if (test2Cnt == 12 && test2Arr[test2Cnt] == 0) {
                setNoAns(true);
              }
              if (test2Arr[test2Cnt] != 0) {
                setTest2Cnt(test2Cnt + 1);
              } else {
                setNoAns(true);
              }
            }}
          >
            <h6>Далее</h6>
            <img src={arrow} alt="icon" />
          </button>
        ) : (
          <></>
        )}
        <h4>{test2Cnt + 1}/13</h4>
        {test2Cnt < 14 ? (
          <>
            <div>
              <img className="papersIcon" src={papersIcon} alt="icon" />
              <h3>
                В этом опроснике содержатся группы утверждений. Внимательно
                прочитайте каждую группу утверждений. Затем определите в каждой
                группе одно утверждение, которое лучше всего соответствует тому,
                как Вы себя чувствовали на этой неделе и сегодня.
              </h3>
            </div>
            <h3>
              Поставьте галочку около выбранного утверждения. Если несколько
              утверждений из одной группы кажутся Вам одинаково хорошо
              подходящими, то поставьте галочки около каждого из них. Прежде,
              чем сделать свой выбор, убедитесь, что Вы прочли все утверждения в
              каждой группе.
            </h3>
          </>
        ) : (
          <></>
        )}
        <img
          src={close}
          alt="close"
          className="close"
          onClick={() => {
            setTestID(0);
            setTest2Arr([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]);
            setTest2Cnt(0);
          }}
        />
        <div
          className="progress"
          style={{ width: test2Cnt > 12 ? "100%" : `${progressWidth2}%` }}
        ></div>
        <h5 className="qTitle">
          {Test2Titles[test2Cnt]} {noAns ? <span>Выберите ответ</span> : <></>}
        </h5>
        {test1Cnt < 14 ? (
          <>
            <div
              className="qAns"
              onClick={() => {
                setNoAns(false);
                updateElementAtIndex2(test2Cnt, 1);
              }}
            >
              <div
                className="qSquare"
                style={{
                  backgroundColor:
                    test2Arr[test2Cnt] === 1 ? "#d88755" : "initial",
                  border: noAns ? "1px solid red" : "1px solid #464646",
                }}
              ></div>
              <h6 className="qText">{Test2Qs[test2Cnt][0]}</h6>
            </div>
            <div
              className="qAns"
              onClick={() => {
                setNoAns(false);
                updateElementAtIndex2(test2Cnt, 2);
              }}
            >
              <div
                className="qSquare"
                style={{
                  backgroundColor:
                    test2Arr[test2Cnt] === 2 ? "#d88755" : "initial",
                  border: noAns ? "1px solid red" : "1px solid #464646",
                }}
              ></div>
              <h6 className="qText">{Test2Qs[test2Cnt][1]}</h6>
            </div>
            <div
              className="qAns"
              onClick={() => {
                setNoAns(false);
                updateElementAtIndex2(test2Cnt, 3);
              }}
            >
              <div
                className="qSquare"
                style={{
                  backgroundColor:
                    test2Arr[test2Cnt] === 3 ? "#d88755" : "initial",
                  border: noAns ? "1px solid red" : "1px solid #464646",
                }}
              ></div>
              <h6 className="qText">{Test2Qs[test2Cnt][2]}</h6>
            </div>
            {test2Cnt != 8 ? (
              <div
                className="qAns"
                onClick={() => {
                  setNoAns(false);
                  updateElementAtIndex2(test2Cnt, 4);
                }}
              >
                <div
                  className="qSquare"
                  style={{
                    backgroundColor:
                      test2Arr[test2Cnt] === 4 ? "#d88755" : "initial",
                    border: noAns ? "1px solid red" : "1px solid #464646",
                  }}
                ></div>
                <h6 className="qText">{Test2Qs[test2Cnt][3]}</h6>
              </div>
            ) : (
              <></>
            )}
          </>
        ) : (
          <h4>ANS</h4>
        )}
      </div>
    );
  }
  function Test3() {
    return (
      <div className="Test Test3">
        {test3Cnt > 0 ? (
          <button className="btnPrev" onClick={() => setTest3Cnt(test3Cnt - 1)}>
            <img src={arrow} alt="icon" />
            <h6>Назад</h6>
          </button>
        ) : (
          <></>
        )}
        {test3Cnt < 22 ? (
          <button
            className="btnNext"
            onClick={() => {
              if (test3Cnt == 20 && test3Arr[test3Cnt] != 0) {
                setTestID("Form3");
              } else if (test3Cnt == 20 && test3Arr[test3Cnt] == 0) {
                setNoAns(true);
              }
              if (test3Arr[test3Cnt] != 0) {
                setTest3Cnt(test3Cnt + 1);
              } else {
                setNoAns(true);
              }
            }}
          >
            <h6>Далее</h6>
            <img src={arrow} alt="icon" />
          </button>
        ) : (
          <></>
        )}
        <h4>{test3Cnt + 1}/21</h4>
        {test3Cnt < 22 ? (
          <>
            <div>
              <img className="papersIcon" src={papersIcon} alt="icon" />
              <h3>
                Данный список содержит наиболее распространенные симптомы
                тревоги. Пожалуйста, тщательно изучите каждый пункт. Отметьте,
                насколько Вас беспокоил каждый из этих симптомов в течение
                последней недели, включая сегодняшний день, поставив крестик в
                соответствующей колонке справа.
              </h3>
            </div>
            <h3></h3>
          </>
        ) : (
          <></>
        )}
        <img
          src={close}
          alt="close"
          className="close"
          onClick={() => {
            setTestID(0);
            setTest3Arr([
              0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            ]);
            setTest3Cnt(0);
          }}
        />
        <div
          className="progress"
          style={{ width: test3Cnt > 20 ? "100%" : `${progressWidth3}%` }}
        ></div>
        <h5 className="qTitle">
          {Test3Titles[test3Cnt]} {noAns ? <span>Выберите ответ</span> : <></>}
        </h5>
        {test3Cnt < 22 ? (
          <>
            <div
              className="qAns"
              onClick={() => {
                setNoAns(false);
                updateElementAtIndex3(test3Cnt, 1);
              }}
            >
              <div
                className="qSquare"
                style={{
                  backgroundColor:
                    test3Arr[test3Cnt] === 1 ? "#d88755" : "initial",
                  border: noAns ? "1px solid red" : "1px solid #464646",
                }}
              ></div>
              <h6 className="qText">{Test3Qs[test3Cnt][0]}</h6>
            </div>
            <div
              className="qAns"
              onClick={() => {
                setNoAns(false);
                updateElementAtIndex3(test3Cnt, 2);
              }}
            >
              <div
                className="qSquare"
                style={{
                  backgroundColor:
                    test3Arr[test3Cnt] === 2 ? "#d88755" : "initial",
                  border: noAns ? "1px solid red" : "1px solid #464646",
                }}
              ></div>
              <h6 className="qText">{Test3Qs[test3Cnt][1]}</h6>
            </div>
            <div
              className="qAns"
              onClick={() => {
                setNoAns(false);
                updateElementAtIndex3(test3Cnt, 3);
              }}
            >
              <div
                className="qSquare"
                style={{
                  backgroundColor:
                    test3Arr[test3Cnt] === 3 ? "#d88755" : "initial",
                  border: noAns ? "1px solid red" : "1px solid #464646",
                }}
              ></div>
              <h6 className="qText">{Test3Qs[test3Cnt][2]}</h6>
            </div>
            <div
              className="qAns"
              onClick={() => {
                setNoAns(false);
                updateElementAtIndex3(test3Cnt, 4);
              }}
            >
              <div
                className="qSquare"
                style={{
                  backgroundColor:
                    test3Arr[test3Cnt] === 4 ? "#d88755" : "initial",
                  border: noAns ? "1px solid red" : "1px solid #464646",
                }}
              ></div>
              <h6 className="qText">{Test3Qs[test3Cnt][3]}</h6>
            </div>
          </>
        ) : (
          <h4>ANS</h4>
        )}
      </div>
    );
  }
  function Test4() {
    return (
      <div className="Test Test4">
        {test4Cnt < 30 ? (
          <h1>Какой из этих цветов кажется вам наиболее симпатичным?<br/>Нажимайте на цвет по порядку Вашей симпатии.</h1>
        ) : (
          <></>
        )}
        {test4Cnt < 30 ? <h4>{test4Cnt + 2}/32</h4> : <></>}
        {test4Cnt < 30 ? (
          <div
            className="progress"
            style={{ width: `${progressWidth4}%` }}
          ></div>
        ) : (
          <></>
        )}
        <img
          src={close}
          alt="close"
          className="close"
          onClick={() => {
            setTest4Arr([]);
            setTest4ArrFinal([]);
            setTest4Cnt(-1);
            setTestID(0);
            setTest4ArrGray([]);
          }}
        />
        {test4Cnt == -1 ? (
          <div className="test4Colors1">
            <div
              className="block"
              style={{
                flexGrow: "0",
                backgroundColor:
                  test4ArrGray.indexOf(0) == -1 ? "#c7c0b8" : "white",
              }}
              onClick={() => {
                if (test4ArrGray.indexOf(0) == -1) {
                  setTest4ArrGray([...test4ArrGray, 0]);
                }
                if (test4ArrGray.length === 4) {
                  setTest4Cnt(0);
                }
              }}
            ></div>
            <div
              className="block"
              style={{
                flexGrow: "0",
                backgroundColor:
                  test4ArrGray.indexOf(1) == -1 ? "#98948b" : "white",
              }}
              onClick={() => {
                if (test4ArrGray.indexOf(1) == -1) {
                  setTest4ArrGray([...test4ArrGray, 1]);
                }
                if (test4ArrGray.length === 4) {
                  setTest4Cnt(0);
                }
              }}
            ></div>
            <div
              className="block"
              style={{
                flexGrow: "0",
                backgroundColor:
                  test4ArrGray.indexOf(2) == -1 ? "#e3e3e3" : "white",
              }}
              onClick={() => {
                if (test4ArrGray.indexOf(2) == -1) {
                  setTest4ArrGray([...test4ArrGray, 2]);
                }
                if (test4ArrGray.length === 4) {
                  setTest4Cnt(0);
                }
              }}
            ></div>
            <div
              className="block"
              style={{
                flexGrow: "0",
                backgroundColor:
                  test4ArrGray.indexOf(3) == -1 ? "#211f20" : "white",
              }}
              onClick={() => {
                if (test4ArrGray.indexOf(3) == -1) {
                  setTest4ArrGray([...test4ArrGray, 3]);
                }
                if (test4ArrGray.length === 4) {
                  setTest4Cnt(0);
                }
              }}
            ></div>
            <div
              className="block"
              style={{
                flexGrow: "0",
                backgroundColor:
                  test4ArrGray.indexOf(4) == -1 ? "#5e5e60" : "white",
              }}
              onClick={() => {
                if (test4ArrGray.indexOf(4) == -1) {
                  setTest4ArrGray([...test4ArrGray, 4]);
                }
                if (test4ArrGray.length === 4) {
                  setTest4Cnt(0);
                }
              }}
            ></div>
          </div>
        ) : (
          <></>
        )}
        {test4Cnt == 0 ? (
          <div className="test4Colors1">
            <div
              className="block"
              style={{
                flexGrow: "0",
                backgroundColor:
                  test4Arr.indexOf(0) == -1 ? "#808080" : "white",
              }}
              onClick={() => {
                if (test4Arr.indexOf(0) == -1) {
                  setTest4Arr([...test4Arr, 0]);
                }
                if (test4Arr.length === 7) {
                  setTest4Cnt(1);
                }
              }}
            ></div>
            <div
              className="block"
              style={{
                flexGrow: "0",
                backgroundColor:
                  test4Arr.indexOf(2) == -1 ? "#008000" : "white",
              }}
              onClick={() => {
                if (test4Arr.indexOf(2) == -1) {
                  setTest4Arr([...test4Arr, 2]);
                }
                if (test4Arr.length === 7) {
                  setTest4Cnt(1);
                }
              }}
            ></div>
            <div
              className="block"
              style={{
                flexGrow: "0",
                backgroundColor:
                  test4Arr.indexOf(1) == -1 ? "#0000ff" : "white",
              }}
              onClick={() => {
                if (test4Arr.indexOf(1) == -1) {
                  setTest4Arr([...test4Arr, 1]);
                }
                if (test4Arr.length === 7) {
                  setTest4Cnt(1);
                }
              }}
            ></div>
            <div
              className="block"
              style={{
                flexGrow: "0",
                backgroundColor:
                  test4Arr.indexOf(3) == -1 ? "#ff0000" : "white",
              }}
              onClick={() => {
                if (test4Arr.indexOf(3) == -1) {
                  setTest4Arr([...test4Arr, 3]);
                }
                if (test4Arr.length === 7) {
                  setTest4Cnt(1);
                }
              }}
            ></div>
            <div
              className="block"
              style={{
                flexGrow: "0",
                backgroundColor:
                  test4Arr.indexOf(4) == -1 ? "#ffff00" : "white",
              }}
              onClick={() => {
                if (test4Arr.indexOf(4) == -1) {
                  setTest4Arr([...test4Arr, 4]);
                }
                if (test4Arr.length === 7) {
                  setTest4Cnt(1);
                }
              }}
            ></div>
            <div
              className="block"
              style={{
                flexGrow: "0",
                backgroundColor:
                  test4Arr.indexOf(5) == -1 ? "#ff00ff" : "white",
              }}
              onClick={() => {
                if (test4Arr.indexOf(5) == -1) {
                  setTest4Arr([...test4Arr, 5]);
                }
                if (test4Arr.length === 7) {
                  setTest4Cnt(1);
                }
              }}
            ></div>
            <div
              className="block"
              style={{
                flexGrow: "0",
                backgroundColor:
                  test4Arr.indexOf(6) == -1 ? "#8b4513" : "white",
              }}
              onClick={() => {
                if (test4Arr.indexOf(6) == -1) {
                  setTest4Arr([...test4Arr, 6]);
                }
                if (test4Arr.length === 7) {
                  setTest4Cnt(1);
                }
              }}
            ></div>
            <div
              className="block"
              style={{
                flexGrow: "0",
                backgroundColor:
                  test4Arr.indexOf(7) == -1 ? "#000000" : "white",
              }}
              onClick={() => {
                if (test4Arr.indexOf(7) == -1) {
                  setTest4Arr([...test4Arr, 7]);
                }
                if (test4Arr.length === 7) {
                  setTest4Cnt(1);
                }
              }}
            ></div>
          </div>
        ) : (
          <></>
        )}
        {test4Cnt == 1 ? (
          <div className="test4Colors1">
            <div
              className="block"
              style={{ backgroundColor: "#004983" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
            <div
              className="block"
              style={{ backgroundColor: "#f2dd00" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
          </div>
        ) : (
          <></>
        )}
        {test4Cnt == 2 ? (
          <div className="test4Colors1">
            <div
              className="block"
              style={{ backgroundColor: "#1d9772" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
            <div
              className="block"
              style={{ backgroundColor: "#f12f23" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
          </div>
        ) : (
          <></>
        )}
        {test4Cnt == 3 ? (
          <div className="test4Colors1">
            <div
              className="block"
              style={{ backgroundColor: "#004983" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
            <div
              className="block"
              style={{ backgroundColor: "#1d9772" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
          </div>
        ) : (
          <></>
        )}
        {test4Cnt == 4 ? (
          <div className="test4Colors1">
            <div
              className="block"
              style={{ backgroundColor: "#f12f23" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
            <div
              className="block"
              style={{ backgroundColor: "#f2dd00" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
          </div>
        ) : (
          <></>
        )}
        {test4Cnt == 5 ? (
          <div className="test4Colors1">
            <div
              className="block"
              style={{ backgroundColor: "#004983" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
            <div
              className="block"
              style={{ backgroundColor: "#f12f23" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
          </div>
        ) : (
          <></>
        )}
        {test4Cnt == 6 ? (
          <div className="test4Colors1">
            <div
              className="block"
              style={{ backgroundColor: "#1d9772" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
            <div
              className="block"
              style={{ backgroundColor: "#f2dd00" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
          </div>
        ) : (
          <></>
        )}
        {test4Cnt == 7 ? (
          <div className="test4Colors1">
            <div
              className="block"
              style={{ backgroundColor: "#004983" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
            <div
              className="block"
              style={{ backgroundColor: "#f2dd00" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
          </div>
        ) : (
          <></>
        )}
        {test4Cnt == 8 ? (
          <div className="test4Colors1">
            <div
              className="block"
              style={{ backgroundColor: "#1d9772" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
            <div
              className="block"
              style={{ backgroundColor: "#f12f23" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
          </div>
        ) : (
          <></>
        )}
        {test4Cnt == 9 ? (
          <div className="test4Colors1">
            <div
              className="block"
              style={{ backgroundColor: "#004983" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
            <div
              className="block"
              style={{ backgroundColor: "#1d9772" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
          </div>
        ) : (
          <></>
        )}
        {test4Cnt == 10 ? (
          <div className="test4Colors1">
            <div
              className="block"
              style={{ backgroundColor: "#f12f23" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
            <div
              className="block"
              style={{ backgroundColor: "#f2dd00" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
          </div>
        ) : (
          <></>
        )}
        {test4Cnt == 11 ? (
          <div className="test4Colors1">
            <div
              className="block"
              style={{ backgroundColor: "#004983" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
            <div
              className="block"
              style={{ backgroundColor: "#f12f23" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
          </div>
        ) : (
          <></>
        )}
        {test4Cnt == 12 ? (
          <div className="test4Colors1">
            <div
              className="block"
              style={{ backgroundColor: "#1d9772" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
            <div
              className="block"
              style={{ backgroundColor: "#f2dd00" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
          </div>
        ) : (
          <></>
        )}
        {test4Cnt == 13 ? (
          <div className="test4Colors1">
            <div
              className="block"
              style={{ backgroundColor: "#004983" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
            <div
              className="block"
              style={{ backgroundColor: "#55a9ce" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
          </div>
        ) : (
          <></>
        )}
        {test4Cnt == 14 ? (
          <div className="test4Colors1">
            <div
              className="block"
              style={{ backgroundColor: "#2b7381" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
            <div
              className="block"
              style={{ backgroundColor: "#475d8f" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
          </div>
        ) : (
          <></>
        )}
        {test4Cnt == 15 ? (
          <div className="test4Colors1">
            <div
              className="block"
              style={{ backgroundColor: "#004983" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
            <div
              className="block"
              style={{ backgroundColor: "#2b7381" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
          </div>
        ) : (
          <></>
        )}
        {test4Cnt == 16 ? (
          <div className="test4Colors1">
            <div
              className="block"
              style={{ backgroundColor: "#475d8f" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
            <div
              className="block"
              style={{ backgroundColor: "#55a9ce" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
          </div>
        ) : (
          <></>
        )}
        {test4Cnt == 17 ? (
          <div className="test4Colors1">
            <div
              className="block"
              style={{ backgroundColor: "#004983" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
            <div
              className="block"
              style={{ backgroundColor: "#475d8f" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
          </div>
        ) : (
          <></>
        )}
        {test4Cnt == 18 ? (
          <div className="test4Colors1">
            <div
              className="block"
              style={{ backgroundColor: "#2b7381" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
            <div
              className="block"
              style={{ backgroundColor: "#55a9ce" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
          </div>
        ) : (
          <></>
        )}
        {test4Cnt == 19 ? (
          <div className="test4Colors1">
            <div
              className="block"
              style={{ backgroundColor: "#5a773d" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
            <div
              className="block"
              style={{ backgroundColor: "#96cb59" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
          </div>
        ) : (
          <></>
        )}
        {test4Cnt == 20 ? (
          <div className="test4Colors1">
            <div
              className="block"
              style={{ backgroundColor: "#1d9772" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
            <div
              className="block"
              style={{ backgroundColor: "#41a85f" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
          </div>
        ) : (
          <></>
        )}
        {test4Cnt == 21 ? (
          <div className="test4Colors1">
            <div
              className="block"
              style={{ backgroundColor: "#5a773d" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
            <div
              className="block"
              style={{ backgroundColor: "#1d9772" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
          </div>
        ) : (
          <></>
        )}
        {test4Cnt == 22 ? (
          <div className="test4Colors1">
            <div
              className="block"
              style={{ backgroundColor: "#41a85f" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
            <div
              className="block"
              style={{ backgroundColor: "#96cb59" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
          </div>
        ) : (
          <></>
        )}
        {test4Cnt == 23 ? (
          <div className="test4Colors1">
            <div
              className="block"
              style={{ backgroundColor: "#5a773d" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
            <div
              className="block"
              style={{ backgroundColor: "#41a85f" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
          </div>
        ) : (
          <></>
        )}
        {test4Cnt == 24 ? (
          <div className="test4Colors1">
            <div
              className="block"
              style={{ backgroundColor: "#1d9772" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
            <div
              className="block"
              style={{ backgroundColor: "#96cb59" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
          </div>
        ) : (
          <></>
        )}
        {test4Cnt == 25 ? (
          <div className="test4Colors1">
            <div
              className="block"
              style={{ backgroundColor: "#c55223" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
            <div
              className="block"
              style={{ backgroundColor: "#b33e2c" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
          </div>
        ) : (
          <></>
        )}
        {test4Cnt == 26 ? (
          <div className="test4Colors1">
            <div
              className="block"
              style={{ backgroundColor: "#fa802a" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
            <div
              className="block"
              style={{ backgroundColor: "#f12f23" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
          </div>
        ) : (
          <></>
        )}
        {test4Cnt == 27 ? (
          <div className="test4Colors1">
            <div
              className="block"
              style={{ backgroundColor: "#c55223" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
            <div
              className="block"
              style={{ backgroundColor: "#fa802a" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
          </div>
        ) : (
          <></>
        )}
        {test4Cnt == 28 ? (
          <div className="test4Colors1">
            <div
              className="block"
              style={{ backgroundColor: "#f12f23" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
            <div
              className="block"
              style={{ backgroundColor: "#b33e2c" }}
              onClick={() => setTest4Cnt(test4Cnt + 1)}
            ></div>
          </div>
        ) : (
          <></>
        )}
        {test4Cnt == 29 ? (
          <div className="test4Colors1">
            <div
              className="block"
              style={{
                backgroundColor:
                  test4ArrFinal.indexOf(0) == -1 ? "#808080" : "white",
              }}
              onClick={() => {
                if (test4ArrFinal.indexOf(0) == -1) {
                  setTest4ArrFinal([...test4ArrFinal, 0]);
                }
                if (test4ArrFinal.length === 7) {
                  setTest4Cnt(30);
                }
              }}
            ></div>
            <div
              className="block"
              style={{
                backgroundColor:
                  test4ArrFinal.indexOf(2) == -1 ? "#008000" : "white",
              }}
              onClick={() => {
                if (test4ArrFinal.indexOf(2) == -1) {
                  setTest4ArrFinal([...test4ArrFinal, 2]);
                }
                if (test4ArrFinal.length === 7) {
                  setTest4Cnt(30);
                }
              }}
            ></div>
            <div
              className="block"
              style={{
                backgroundColor:
                  test4ArrFinal.indexOf(1) == -1 ? "#0000ff" : "white",
              }}
              onClick={() => {
                if (test4ArrFinal.indexOf(1) == -1) {
                  setTest4ArrFinal([...test4ArrFinal, 1]);
                }
                if (test4ArrFinal.length === 7) {
                  setTest4Cnt(30);
                }
              }}
            ></div>
            <div
              className="block"
              style={{
                backgroundColor:
                  test4ArrFinal.indexOf(3) == -1 ? "#ff0000" : "white",
              }}
              onClick={() => {
                if (test4ArrFinal.indexOf(3) == -1) {
                  setTest4ArrFinal([...test4ArrFinal, 3]);
                }
                if (test4ArrFinal.length === 7) {
                  setTest4Cnt(30);
                }
              }}
            ></div>
            <div
              className="block"
              style={{
                backgroundColor:
                  test4ArrFinal.indexOf(4) == -1 ? "#ffff00" : "white",
              }}
              onClick={() => {
                if (test4ArrFinal.indexOf(4) == -1) {
                  setTest4ArrFinal([...test4ArrFinal, 4]);
                }
                if (test4ArrFinal.length === 7) {
                  setTest4Cnt(30);
                }
              }}
            ></div>
            <div
              className="block"
              style={{
                backgroundColor:
                  test4ArrFinal.indexOf(5) == -1 ? "#ff00ff" : "white",
              }}
              onClick={() => {
                if (test4ArrFinal.indexOf(5) == -1) {
                  setTest4ArrFinal([...test4ArrFinal, 5]);
                }
                if (test4ArrFinal.length === 7) {
                  setTest4Cnt(30);
                }
              }}
            ></div>
            <div
              className="block"
              style={{
                backgroundColor:
                  test4ArrFinal.indexOf(6) == -1 ? "#8b4513" : "white",
              }}
              onClick={() => {
                if (test4ArrFinal.indexOf(6) == -1) {
                  setTest4ArrFinal([...test4ArrFinal, 6]);
                }
                if (test4ArrFinal.length === 7) {
                  setTest4Cnt(30);
                }
              }}
            ></div>
            <div
              className="block"
              style={{
                backgroundColor:
                  test4ArrFinal.indexOf(7) == -1 ? "#000000" : "white",
              }}
              onClick={() => {
                if (test4ArrFinal.indexOf(7) == -1) {
                  setTest4ArrFinal([...test4ArrFinal, 7]);
                }
                if (test4ArrFinal.length === 7) {
                  setTest4Cnt(30);
                }
              }}
            ></div>
          </div>
        ) : (
          <></>
        )}
        {test4Cnt === 30 ? (
          <div className="Form4">
            <h3>
              Результаты интерпретируются специалистом. Для получения итогов
              укажите ваше имя и электронную почту.
            </h3>
            <div className="line"></div>
            <form ref={form1} onSubmit={sendEmailTest1}>
              <input type="text" placeholder="Ваше имя" name="user_name" />
              <input type="email" placeholder="Ваша почта" name="user_email" />
              <button className="form4Btn">Отправить</button>
              <input
                type="text"
                name="test1_result_text"
                style={{ display: "none" }}
                value={lusherAns}
              />
              <input
                type="text"
                name="test_call_text"
                style={{ display: "none" }}
                value={
                  "Хотите лучше разобраться в себе и узнать свои сильные стороны? Дарим персональный промокод"
                }
              />
              <input
                type="text"
                name="test1_result_title"
                style={{ display: "none" }}
                value="Ваш результат"
              />
            </form>
          </div>
        ) : (
          <></>
        )}
      </div>
    );
  }
}

export default App;
